[
  "Tahle hra je jedna z nejlepších co jsem kdy hrál, pokud si chcete zahrát střílečku a nevíte jakou, tak tahle vás zabaví i na několik set hodin. Nemám co vytknout, hra rozhodně není pay2win a Valve vydává neustálé aktualizace. Za mě 10/10",
  "The feeling when you close the game is similar of taking shit after a long day\n",
  "jo je to v poho hra ty mapy jsou super. Doporučuji.",
  "Good game but also cheaters and idiots. Very nice. Good job Valve",
  "je to dobrá hra nigga, ale jsou tam samí rusáci a jsou toxic kokoti zkurvený",
  "člocek sa nauči zvladať kriticke situacie vytorene ľuďmi ktorí vedia piču o hre alebo sa naučia plynule nadavať turecky rusky poľsky a všetky tie ostatne indianske jazyky :) vrele odporučam pre vašeho syna",
  "hra je to dobra ale nechapu co delaj ti kokoti ve valve ze tu beha tolik curaku s cheatama",
  "urcite doporucuju za par let dostanete mozkovej otok",
  "YES, BEST GAME EVER, BUT PLEASE MAKE 128TICK SERVERS IN MM.",
  "top hra kdyz nekdo necheatuje nebo kdyz nepotkáš kida co je silver a říka ti že cheatuješ",
  "Úžasná hra, nedokážu se od ní odtrhnout. I přesto, že si po každém kole říkám proč jsem tak neschopný a zbytečný člověk, a proč mají ostatní takové štěstí ve hře a dokážou v životě vůbec něco udělat a něčeho dosáhnout. 10/10",
  "[h1]CS:GO[/h1]\nLike this game sucks your life and money out and destroys your sanity. But overall it's a good game. I guess I've played it sometimes and maybe even had fun, but those days I don't remember. [b]So have fun playing this great FPS game[/b]. Hope you will enjoy it and join this community",
  "CS:GO je fajn hra všichni jí určitě znají občas je zde toxická komunita ale pokud vás ta hra bude bavit tak se toho dá nevšímat a kdyžtak se dá díkybohu někdo mutnout",
  "Great game,............... sarcasm\n\n\n\n\n\n2020 upgrade-still feel it same",
  "\"Nezplesnivělý\" chleba ,který prostě nechce zplesnivět. Chemický postřik. Nedoporučil bych ho pro všechny rohlíky.",
  "kokotina cheater na kazdom rohu, clovek aby si urobil anicheat sam do vrecka, inak nech mi valve olize moj pipik",
  "This game is very fun, and easy to use. The game system is very good. The only problem in the game is that there are an awful lot of cheaters that can't be done with.",
  "No tak kde začít. Snad není někdo kdo by za dobu své existence neslyšel o sérii Counter Strike. Ta už přinesla skvosty jako je cs 1.6, cs source a cs condition zero což byly opravdu povedené tituly. No a když oznámili novou hru dalo se očekávat že se bude jednat o další skvělou hru. A tak to taky je. CS:GO je opravdu v mnoha ohledech skvělé , přímo až bravurně zpracované.\n\nCelkově celá hra působí dobře. Odehrál jsem skoro 500 hodin a hraju jí něco kolem 4 let. Díky této hře jsem poznal spoustu skvělých lidí se kterými si vždy velice rád zahraji. Hra má krásnou grafiku a na nejmenší detaily se dá hrát v podstatě skoro na každém počítači. Samotná hra nabízí veliké množství zbraní a map. Hra má stálé mapy jako Mirage nebo Dust II ale když příjde operace map je o trochu více. To je další up pro csko protože operace i když stojí peníze tak opět vdechne hře život. Ve hře je také možství modu tak že když už jste znudění nenáročným a kompetitivním modem je zde na výběr spousta dalších herních modu. Zároven zde fungují komunitní servery kde si můžete zahrát staré dobré klasiky z 1.6, jako je jailbreak,bhop a surf a mnohem více. Celkově hra nabízí spostu obsahu a spoustu zábavy a možností jak si hru vychutnat. Hra si i po dlouho dobu své existence své hráče udržela , má na to vliv samozdřejmě že je csgo free a myslím si že si cenu nesmrtelná hra opravdu zaslouží. Jediné co by se kromě nepochopeného odstranění botů, hodně zvláštního rank up systému vytkl je snad jen to že je hra plná malých děcek a otravných rusáků ale tohle valve samozdřejmě neovlivní. Hra je i tak prostě masterpiece.\n\n+ grafika\n+ hratelnost\n+ ovládání\n+ komunitní servery\n+ živé vysílání z esport zápasů\n+ workshop\n+ cases a skiny atd.\n\n- zvláštní rank up systém\n- občas rozbité vyhledávání zápasů\n- odstranění botů\n\nZa mě je hra 10/10 a už se těším na budoucí counter stike , který snad někdy v budoucnu vyjde. Hru si určitě stáhnětě ale doporučuji spíše koupit a samozdřejmě doporučuji invesovat do operací :)",
  "players who baught the actual game should at lest recieve this battle pass thing for free now we pay 15$ for f2p game and also have to payt for drops nice valve do someting!!!!!",
  "Moc pěkná hra, ale chtělo by to omezit počet lidí, kteří používají cheaty. Začít by jste třeba tím že zlepšite AntiCheat a upravite hitboxi hráčů. 🙂🙂🙂🙂\n",
  "Nejvetší mrdka dostal jsem nepraven ban za hacky kdyz mam 2 600+ hrs a hral jsem tak pořad to že jsem pustil spray do smoke a zabil jsem 2 neznamena hned že bych měl byt usvedčen dozorem... MRDKY",
  "Takhle hra je jako droga jednou zahraješ a už se jí nezbavíš :D , hodnocení je cca 50/50 CSGO má své + tak i - , i když mě ta hra sere tak je fajn, ale mělo by se hodně na ní pracovat a zvýší se tak i hráči",
  "Kazdou vyjebanou hru mam v team zkurveny dvanacti lety rusky zmrdy ktery mi jen griefujou hru protoze sou totalne vyjebany a spatny a kokoti a nic neumi a muj enemy team mi pise ze cheatuju protoze sou stejne spatny jak muj team",
  "drasa mi to nervi ale i pres to tuto hru hraji tohle nedojate jak kreta hra",
  "pokud máte pevné nervy dobrý internet a dostatečný počet snímků rozhodně doporučuji jen prosím necheatujte kazíte tím hru ostatním",
  "Dost dobrá hra ale když nemáte prime tak tam máte cheatery\n",
  "It is a great game even after free to play update because I started playing is because of that update and if u get over first 30 levels in prime then u don't get that many cheaters. After 1k hours I would say it is still one of the best Comunity games out there and it is fun with the right people.",
  "Lepší anticheat by to chtělo po updatu na Free to Play, jinak prostě klasika.",
  "trashest comunity ever always shits kids, russians, and fuqing idiots with negev",
  "Counter Strike more like Cheater Strike but its funny game",
  ":::::::::::::::/::::::/::::::::::::::::\\:::::::::::::::-,::-,::”-, ::::::\\::::\\:\\...\n... ... ...,-“:::::,-“:::/:::::/::::::/:|:::::::::::::::::\\::::::::::::::::\\::::\\::\\,”-,\n... ... .,-“:::::::/:::::|:::::|:::::::|:|::::::::::::::::::\\\\:::::::::::::|:|:::::\\:::\\::\\\n... ... /::::::::::|::::::|:::::|\\::::::\\:\\::::::::::::::::::||::::::::::::|:/::::::|::::|::\\\n... .../::::::::::::\\:::::::\\::::'\\”-,::::\\:\\,:::::::::::::::|:|::::::::::,//::::::/::::|:::'|\n... ../::::::::::::::'\\::::::\\-,:::”-,”-,::\\-,”-,,:::::::::/: |::::::,-“//::::::/:::::/::,,-'\n... ./:::::::::::::::::”,-,,::\\|”~-,,\\,:”~-\\”: :”-,::::/: :/:::,-“: :/::,-“/:::,-“:::/\n... /::::::::::::::::::/,__”-,\\: : ,,-~”,”',-,: : :\\:/: :/:,-“,-~,”-,”:/:,,-“:,-//'\n... |:::::::::::::::::/:o:::o: :,,-“/. ,-“:\\.|: : : : “: -'”:/./,--,”\\.'|”/::::::|-“\n...|::::::/:::::::::/::/|:::|.\\: : \\.|'|¯;|..|.|: : : : : : : :|.||;;;|././:|:::|:::|\n...|::|:::|::::::::/::'-I':::'-,': : '\\'\\'~'_/,/: : : : : : ,: :'-'-¯-'~': |:::|:::|\n...|::|:::|::::::::/::::|:::::'|: : : “' ¯: : : : : : : : : :\\: : : : : : /::::'\\::|\n...|::|:::|:::::::/:::::|:::::'\\: : : : : : : : : : : : : : :': : : : : :/::::::|::|\n... \\:|:::|::::::|::::::|::::::|,: : : : : : : : : :__,: : : : : : :,-“:::::::|::|\n... .'\\|::|::::::|::::::||::::::\\'~,: : : : : : : :'--~': : : : ,,~”\\:::::::::|:/\n... ...'\\:|:::::|::::::/.|::::::|: : “~,: : : : : : : : ,,-~,”::::::'\\:::::::|:/\n... ... .\\\\:::::|”~,/-,|:::::::|: : : : ¯”~,-,,,-~”:::,,-'\\::::::::\\-,,_:|/\n... ... ..',\\,::|~--'-~\\:::::::|: : : : : : |::|,,-~”¯___\\::::::::\\... .'|\n... ..,~”': : \\|: : : : : \\::::::|: : : : : : |¯”'~~”~,”,: : \\:::::::|... /\n..,-“: : : : : :|: : : : : :\\::::::|: : : : : : \\: : : : : : “~'-,:\\::::::|\\,/\n..|: : : : : : : |: : : : : : |::::|,\\,: : : : : : : : : : : : : :”-,-\\::::|: \\\n..| : : : : : : : : : : : : : |::::|:'-,\\: : : : : : : : : : : : : : :”-'\\,|: :|\n...\\ : : : : : : : : : :'\\: : :\\:::|: : '\\'\\: : : : :~,,: : : : : : : : : “~-',_\n... \\: : : : : : : : : : :\\: /:|:/: : : :',-'-,: : : : : “-,: : : : : : : : : : :,/”'-,\n... .\\: : : : : : : : : : :\\|: |/: : : ,-“....”-,: : : : : '\\: : : : : : : : : ,/.....”-,\n... ...\\: : : : : : : : : : \\: |: : ./............\\ : : : : ::\\ : : : : : : /“...........'\\\n... ... .\\ : : : : : : : : : '\\': : /...............\\ : : : ::/ : : : : :,-“...............|\n... ... ...\\ : : : : : : : : : '\\:/..................\\ : :,::/ : : : : :/................./\n... ... .....\\ : : : : : : : : : \\...................\\...../.::::: : :/,........... ...../\n... ... ... ...\\ : : : : : : : : : \\,_.............._,”======',_..............,-“\n... ... ... ... \\,: : : : : : : : : \\: ¯”'~---~”¯: : : : : : : : : :¯”~~,:::::\\\n... ... ... ... ..'\\,: : : : : : : : : \\: : : : : : : : : : : : : : : : : : : '\\: : : \\\n... ... ... ... ... .\\, : : : : : : : : '\\: : : : : : : : : : : : : : : : : : :|: : ::\\\n... ... ... ... ... ...\\,: : : : : : : : : \\: : : : : : : : : : : : : : : : : :I : : :|\n... ... ... ... ... ... ..\\ : : : : : : : : \\: : : : : : : : : : : : : : : : :|: : : :|\n... ... ... ... ... ... ...\\\\,: : : : : : : , \\: : : : : : : : : : : : : : : I: : : : |\n... ... ... ... ... ... ... .\\\\ : : : : : : : :'\\ : : : : : : : : : : : : : :|: : : : |",
  "this game is sooooooooooooooooo goooooooooooodddddddddddddd i like it \n",
  "Csko každý zná každý ví, ta komunita není zlá když je člověk trochu imunní",
  "JE TO GOOD HRA HRAJE SE DOBŘE POKUD NENAJDEŠ   HACKERY \n",
  "Dobrá hra, ale hratelná prakticky jen když máte Prime.",
  "5 years of cs 1.6, 8 years of cs:go and still not enough",
  "Doporučuji pokud chcete chytit raka nebo hrát se svými RuskoPolskými bratry :)",
  "Not bad, but low trush factor so i need to be active and act I love this game, its not bad but full of cheaters and smurfs. So for gold 3 player is hard to play",
  "Neuvěřitelná změna oproti 1.6 a Source. Kvalitní grafika i zvuky, zpracování perfektní, animace úžasná. Nemám, co vytknout, ale pokud něco pochválit, tak komunitní trh, nové mapy a celou tu \"věc\" kolem skinů / itemů. Ta šílenost rozpumpovala lidem srdce, nervy i peněženky. Marketingovej tah - na jedničku! :P",
  "I love this game.... i make so much friends in this game ",
  "my favorite game, but valve can buy new anticeat and it will be the best :)",
  "https://steamcommunity.com/tradeoffer/new/?partner=320084586&token=rVVwgP3V",
  "Nejlepší hra kterou můžete hrát !!!!!\n\njednou větou : CSKO je život.",
  "Best hra, akorát moc updatů takže se to časem přestane asi hrát xd",
  "Rozhodl jsem se předělat recenzi, protože si myslím, že hra, ve které jsem strávil suverénně nejvíce hodin na Steamu, si zaslouží poněkud obsáhlejší hodnocení. S tím jde bohužel ruku v ruce problém s jazykem a jelikož bude toto review o něco delší, než všechny, které jsem dosud napsal a moje angličtina není úplně stoprocentní, rozhodl jsem se ho psát ve svém rodném jazyce a všem cizincům se tímto omlouvám (ano, vím, že si to stejně nepřeloží). \n\nCounter Strike : Global Offensive je dle mého názoru jednou z nejlepších her v poměru cena:znovuhratelnost, které se dají pořídit na Steamu. Lze v ní strávit stovky hodin a stejně neomrzí. Ostatně podívejte se sami na komunitu a zjistíte, že drtivá vetšina lidí má odehráno mnoho hodin, v porovnání s jinými hrami. Pokud by někoho zajímalo přesné číslo, tak je podle údajů z roku 2014 CS:GO devátou nejhranější hrou na Steamu podle počtu odehraných hodin (zdroj: [url]http://arstechnica.com/gaming/2014/04/introducing-steam-gauge-ars-reveals-steams-most-popular-games/2/[/url])\n\nInvestice do hry se také, v závislosti na délce herního času a obchodním umu uživatele, rychle vrátí. Jako odměnu za odehrané zápasy dostáváte totiž krabice se skiny, které se dají na tržišti prodat a tím získat nějaké to euro zpět na svůj účet. Postupně vycházejí nové kolekce krabic a novinky se dají v prvních dnech prodat za slušnou cenu. První den třeba i za 2-3€, což znamená, že hra se Vám může zaplatit už jednou prodanou bednou. Ve slevě se totiž dá pořídít za nějaké 3€, což je za tu cenu opravdu tutovka. \n\nNakousl jsem zde již téma skinů na zbraně a tak bych rád, než se dostanu k samotnému hraní, vysvětlil o co jde. Jedná se v podstatě o obrázky na zbraních, které se dají pořídit na tržišti, dropem po odehrání her, nebo z krabic, které se odemykají klíči, které se musí koupit ve hře. Princip je obdobný, jako například ve hře Team Fortress 2. Vzhled zbraní se dá také upravit nálepkami a podobně. Je ovšem důležité zdůraznit, že se jedná o změny ryze kosmetické a co se týče hraní samotného, tak hráči nepřinášejí žádné výhody, což znamená, že hra rozhodně není pay to win. \n\nCo se týče zbraní, tak mají oba týmy na výběr z mnoha zbraní, které mohou být u týmů rozdílné, avšak mají podobnou sílu. Arzenál zbraní je postupně doplňován, od vydání hry přibyly například M4A1 ve verzi s tlumičem, nebo naše česká klasika CZ 75 v automatickém provedení. Pro nováčky ještě rozvedu, že týmy míním teroristy a protiteroristy. Hra, stejně jako předchozí díly, obsahuje dva základní herní módy. V prvním se teroristé snaží položit bombu na stanovené body a poté jí odpálit, protiteroristické jednotky jim v tom zabránit. Druhým je klasické osvobozování rukojmí. Toto je závislé na herních mapách, které jsou většinou speciálně vytvořené pro jednotlivé módy. Tyto herní módy se dají hrát buď v nenáročném módu, nebo módu kompetitivním. Jak již název napovídá, kompetitivní mód je mód soutěžní a určuje rank hráče. Rank je v podstatě ukazatel síly hráče a na základě ranků jsou hráči spojováni na servery v kompetitivních zápasech. Hráč má tedy jistotu, že je hraje proti lidem, kteří jsou podobně silní. Pro představu zde uvádím odkaz na přehled všech ranků : [url]http://cloud-4.steampowered.com/ugc/1117158766046342923/31403BEFD00407DF9D16EBDDE500EB7FE32E18B3/[/url]\n\nKompetitivní mód je nejhranějším herním módem, ovšem skýtá také některá negativa. Tím hlavním bych jmenoval komunitu, o které obecně nemohu prohlásit moc pozitivního, ve srovnání s komunitami jiných her. Často totiž nárážím na hráče, kterým nic neříká týmová spolupráce, která je v kompetitivním módu základním hlavním kamenem úspěchu a bez ní se vyhrát nedá. Častokrát se jedná o lidi, kteří nerozumí anglicky, což je důležitá vlastnost pro hraní komp. módu. Týmy jsou totiž často internacionální a mezi sebou hráči komunikují předevšim anglicky. Základy, jako říkat týmu, kde se nachází kolik nepřátel, by se měl naučit časem každý, protože nekomunikativní hráči se obecně netěší přílišně oblibě. Další problém je pak s takzvanými griefery, což jsou hráči, kteří schválně kazí hru, ale těch naštěstí není tolik. O poznáni více je cheaterů, jako houby po dešti se objevují ve hře hlavně po slevách, kdy si mohou koupit novou kopii hry za příznivou cenu po tom, co byli na předchozím účtě zabanováni. Jedinou obranou proti nim je nahlásit je, což lze provést přes tabulku skóre ve hře. Stejně tak můžete doporučit hráče, který Vám ochotně pomohl, nebo dobře vedl tým. Hráči, kteří mají mnoho doporučení od komunity, mohou sledovat záznamy zápasů nahlášených cheaterů, vyjádřit svůj názor na to, jestli daný hráč opravdu podváděl, nebo ne a tím pomoci zlepšit komunitu hry. \n\nPokud ovšem nemáte chuť na to, hrát ostré zápasy, kde se musí komunikovat, nebo jen čas na celý kompetitivní zápas, který se může protáhnout až na 90 minut, tak CS:GO nabízí mnoho dalších módů. Kromě nenáročného, který jsem již zmínil a je v podstatě to samé, jako kompetitivní, jen se rychleji střídají mapy a hráč může kdykoliv zápas opustit bez penalizace, jsou tu také módy Deathmatch, kde se hraje na body, které se získávají za zabití. Každá zbraň je jinak bodově ohodnocena podle toho, jak těžké je zábití dosáhnout a proto se nejvíce bodů uděluje za nejslabší zbraně. Dále je tu Arms Race, kde je pro výhru nutné zaznamenat zabití každou zbraní ve hře a Demolition, který je podobný spíše nenáročnému módu. Tyto herní módy bych doporučil hlavně nováčkům, než se vrhnou do kompetitivních zápasů. \n\nSkrze hru lze také sledovat zápasy profíků a hlavní výhodou oproti obyčejným streamům je, že lze přepnout na libovolného hráče z obou týmů a odpadá tak nutnost sledovat hráče, který je zrovna streamován. Samozřejmě tím ale přicházíte o komentář, který hlavně při vrcholných turnajích bývá přítomen. Sledováním turnajových eventů lze také získat drahé itemy, které jsou náhodně rozdávány sledujícím. \n\nTeď se již dostávám k samotnému závěru. Hru rozhodně doporučuji. Mnoho negativ nemá, až na komunitu, která až na výjimky není příliš světlým bodem hry a také na některé updaty od Valve, které hru spíše zhoršují. Avšak vývojáři jsou ochotní po odezvě komunity updaty vrátit, jako nedávno po změně optiky sniperek, na kterou šly velmi negativní ohlasy. Nejlepší herní mód je, jak jsem již zmínil kompetitivní, který je, pokud máte pár schopných přátel, jasnou volbou. \n\nTo je tedy vše, doufám, že se Vám recenze líbíla. Jakákoliv zpětná vazba je vítána, abych věděl, zda-li předělat i ostatní recenze do češtiny a trochu více je rozvést. Na viděnou na bojišti.",
  "Skvelá hra, dúfam že samotná hra nezomrie.\nJediné mínusy sú že väčšinou stretávate rusov alebo turkov ktorý na vás nadávaju že ste hlúpy :) Akože mám ich rád ale není to príjemne :D",
  "Tato hra umí být velmi zábavná akorát mě štvou hackeři kteří jsou tam celkem občas i na prime účtě jinak bych určitě tuto hru doporučil všem kterým baví multiplayer střílečky.",
  "Okay už nato seru, střílím s vipem týpek mi tam vběhne omylem ho zabiju, dostanu kick. Comunita je v píči, hodně cheatrů, Chci si zahrát druhej kompet, tam zase kazí hru jiný. Bavila mě ta hra ale už nato nemám.",
  "Hra je sice zábavná, ale matchmaking není nejlepší, i přesto hra stojí za vyzkoušení",
  "Mega dobrá hra, jen by to chtělo omezit počet cheatrů",
  "This is the best shooting game I ever seen. Many maps and nice skins.",
  "skvělá hra v první osobě nikdy mě neomrzí hlavně s přáteli",
  "Je to skvělá kompetitivní hra, lepší se hledá těžko.",
  "CSGO - if you want to be a better person just buy CSGO. You will get good game to train your skill. As individual aim or good decisions. Most important in game is mental fortitude..",
  "Veľmi dobrá hra, odporúčam ľuďom ktorí nemajú radi reálny život :) pritty lišn",
  "ppči hra doporučuji dokoupit i operaci pouze za 13 euro :)",
  "nejlepsi hra na svete od ktere dostanes rakovinu do 2h",
  "Counter-Strike: Global Offensive kráčí svou vlastní cestou. Odmítá pokračovat ve stínu svého předchůdce CS: Source, který změnil vlastně jen grafickou část hry a ostatních aspektů se jen letmo dotknul. Samozřejmě, grafika doznala změn i v nejnovější verzi, ale v daleko větším rozsahu, než v Source se tvůrci v GO zaměřili na celkové vylepšení hry jako takové. Většina klasických a známých map se dočkala velkého množství zásadních úprav. Sváteční hráč nejspíše nezaregistruje jemné nuance, ale dlouholetému harcovníkovi stačí jedno proběhnutí mapou a má jasno. Musím přičíst Valve ke cti, že každou mapu upravila s citem a pocit z hraní je daleko autentičtější.\n\nV dust mapách, které jsou zasazeny do prostředí blízkého východu, objevíte krámky s cetkami, proutěné koše či nádoby. Klenby v rozích dveří, od nichž se odrazí granát zpátky k vám, což bylo naprosto neočekáváné, jelikož dlouhá léta jsem o to místo pravidelně granát nechal odrážet ne soupeře. A k tomu spousta objektů ke krytí… I jemné změny předchozího, sterilního prostředí působí velmi příjemně a člověk cítí potřebu se na chvíli zastavit a prohlédnout si okolí – tuto potřebu samozřejmě ignoruje, protože důležitá je jen zbraň v ruce a kulka v nepříteli.\n\nOstatně, podívejme se na naši zbraň a na ležící mrtvolu. Valve se očividně snaží co nejvíce přiblížit realitě a daří se jim to. Ať už držíte pistoli či kulomet, je věrná své reálné předloze, včetně zvuku výstřelu. Skiny jsou zajímavé zvláště u policistů, jelikož jsou oblečeni do věrných kopií světových antiteroristických skupin, jako jsou třeba němečtí GSG9 nebo francouzští GIGN. Naopak, teroristi či útočníci mají džíny a batohy.",
  "zabava s kamaratmi ale hrozi utrpenie ak hrate sami\n",
  "Docela jeba, ale nemusela by mi dávat vac ban na main, +rep",
  "Za mě je Counter-Strike: Global Offensive skvělá FPS hra. Dá se v ní strávit několik stovek hodin a jediné co by Vás od toho mohlo odradit je ne příliš dobrý anticheat, který nefunguje jak by měl, a tudíž se zde vyskytuje mnoho cheaterů. Co se týče hry jako samotné, tak zde nalezneme několik herních módů například Kompetitivní, bratr ve zbrani (wingman), nenáročný mód atd... V nenáročném módu můžete hrát s lidmi, kteří mají různé dovednosti a hodin strávených ve hře. V nenáročném módu můžete procházet skrz hráče a nemůžete jim udělovat poškození. To je naprostý opak oproti Kompetitivnímu nebo Wingman módu. V kompetitivním módu se hraje pět hráčů na pět hráčů a můžete zde hrát s hráči, kteří mají podobné, néli stejné dovednosti, nebo hodin strávených ve hře. Nemůžete zde procházet skrz hráče a tím pádem se dostáváme k dalšímu bodu a to, že v kompetitivním módu můžete udělovat spoluhráči poškození. Wingman mód je podobný kompetitivnímu módu. Můžete zde udělovat poškození spoluhráči a nemůžete jím procházet. Jediný rozdíl co tady je a tím se odlišuje od kompetitivního módu, tak je, že zde hrajete 2v2, neboli hrajete dva hráči proti dvou hráčům. Poté zde máme ještě módy jako je demelition, nebo arms race, které už nejsou populární, jako již tyto zmíněné. Ve hře Counter-Strike: Global Offensive se můžete připojit i na servery, které jsou vytvořeny samotnými hráči. A samozřejmě ve všech herních módech i na komunitních serverech je aktivní voice chat. Za mě bych hru Counter-Strike: Global Offensive mohl doporučit všem, co mají rádi akční střílečky a nebojí se strávit několik stovek, někdy i tisíce hodin zabíjení nepřátel.\n\n+Většinou skvělá komunita hráčů\n+Hromada herních módů\n+Ve hře se dá strávit klidně tisíce hodin\n+Voice chat\n\n-Bohůžel Anticheat, který není příliš dobrý, a tudíž zde nalezneme hromadu cheaterů\n-Poslední dobou nevycházejí aktualizace hry\n-Někdy až moc toxic lidi\n\nHře bych udělil 7/10 a doporučuji ji těm, co mají rádi akční FPS hry.",
  "Velice dobrá hra, krade mi čas.\nAle nepřestanu ji hrát, dokud si nezlomím vaz.",
  "Velmi dobrá a stále zábavná hra i když už to hraju nějakej ten pátek. Bohužel někdy potkáte v kompetetivním režimu výjevy z nejhorších nočních můr. Přišel jsem na to, že nejsem největší dement, tak jako někteří naši bratři a nebo rusáci.",
  "Its very good game full of good and funny people. I recommend",
  "Komunikace super při vyšších rankách , smysl  ty hry",
  "CS:GO je jedna z najlepších kompetetívnich hier či už na steame alebo inde.\nje to hra ktora vas nepustí od obrazovki, no niekedy ju chcete odinštalovat a už v živote nezapnut\nod klasickich kompetov,nenaročnich modov, aj operacií. ma vela možností čo môžte robit napr:\nvyhravat kompeti a rank upovat alebo hrat s kamaratmi arms race alebo deadmatch.\nza mna je to najlepšia hra ktora sa bude hrat navždy.",
  "Asi netřeba nějak extra představovat, tudíž ve zkratce: Hlavním cílem hry zde nejspíš pro většinu lidí bude vyhrát „kompetitivní zápas“ – taková blbost, kde hra na jednom konci mapy vyplivne pět hráčů, na druhém jiných pět a vaším cílem je pokud možno co nejdříve těm pěti protivníkům ustřelit palici, ideálně o chvilku dříve, než to udělají oni. K tomu vám dopomáhej bůh. No a vzhledem k tomu, že bůh skutečně neexistuje (komunita okolo této hry je toho jasným důkazem), místo něj čas od času pomáhá nějaký šikovný prográmek, ale pouze protivníkům, jelikož pokud máte alespoň 15+ a nemáte v palici totálně nasráno, nebudete přece stahovat hacky, abyste mohli machrovat na ostatní v nějaký online fps střílečce.\n\n++++++++++ když se najde dobrá parta, je to občas i celkem zábava \n\n- ani dobrá parta vám vždy nepomůže k tomu, abyste v klidu vyhráli, aniž by alespoň polovina vašeho týmu rozšlapala klávesnici a zbytek rozkousal myš\n\n- ani dobrá parta vám vždy nepomůže k tomu, abyste někoho neposlali do řiti\n\n- i v dobrý partě si občas někdo může přivést „prudce inteligentního kamaráda“ a v tu chvíli platí bod výše\n\n- i v dobrý partě se čas od času někdo blbě vyspí, pak je celkem zábava to poslouchat (cca prvních 20 sekund), poté pomalu zjišťujete, že už to vlastně taková zábava není a do dvou minut platí opět bod výše\n\n- když máte větší dobrou partu, můžete si klidně vytvořit server a zahrát 5v5 proti sobě, máte sice jistotu, že nikdo nehackuje, ale již po třetím kole většinou padají takové poznámky a narážky, že už to opět s normální zábavou nic společného nemá\n\n- bod výše většinou rozdělí větší dobrou partu na dvě menší dobré party a můžeme to točit opět dokola od bodu jedna, a sice do úplného zblbnutí, či přesně do chvíle, než někdo začne přemýšlet nad tím, proč tu věc vlastně hraje a proč naprosto nesmyslně zabil 3000 hodin svého života\n\n- vždy jsem se snažil respektovat názory jiných, ať už byly sebedebilnější, ale číst v chatu dokola urážky v klingonštině od arogantních, nevychovaných fakanů mě skutečně nebaví a mute bohužel není řešení, jelikož zavřete hubu jednomu a vesele přileze další\n\n- z výše uvedeného důvodu nikdy nehrajte s randomáky, protože to nebudete pouze číst od protihráčů, ale i poslouchat od spoluhráčů\n\n- od doby, co je hra F2P, běhá po mapách horda zapnutých primitivů vlastnící tunu bezcenných, týdenních a soukromých steam profilů, trust factor je vám absolutně na ozdobu a systém banování funguje tak dobře, že už se vám v podstatě nevyplatí nikoho reportovat, ani když je jeho počínání ve hře včetně chování a komunikace s ostatními naprosto průhledné\n\nSystémové požadavky: Cože?? Zapomeňte na to! Na tom dneska rozjedete leda tak piškvorky, kreslení a možná s trochou štěstí i Stíny nad Rivou. Možná by to měl někdo opravit…. Pokud máte možnost, instalujte zásadně na SSD, pořiďte si slušnej internet a modlete se, protože ani tak nemusíte mít vyhráno. Ty servery nejspíš pamatujou Šemíka, když byl ještě hříbě…. Jsou přetížený, dropujou a zkrátka to nestíhají. Jestli mě něco dovede doopravdy pořádně nasrat, je to fakt, že v Office na midu vysypu zásobník do frajera, přičemž se absolutně nic nestane, jelikož on má 740+ ping a je dávno na longu…… ale na Dustu v úplně jinym kompetu!!  \n\nAť se na to koukám, jak chci, vychází mi to tady na 5/10 s hodně odřenou řití. Vzhledem k tomu, že to jedno velké plus ve většině případů ještě hodně těsně převyšuje tu tunu nedostatků, můžu k tomu závěrem napsat pouze jedno: Pokud máte opravdu dobrou partu lidí a toužíte po prvním infarktu již mezi 30. a 40. rokem vašeho života, směle do toho a příjemnou zábavu. Pokud ne, rovnou to odinstalujte a běžte se věnovat něčemu užitečnějšímu. Napadá mě třeba pletení a háčkování pro pokročilé.\n",
  "THIS IS VERY HARD GAME - ONLY CHEATER ...... GOOD GAMMME BTW! xd\n♥♥",
  "Takže by jsme se vrhli do zhodnocení hry...\nKladná recenze bude první a záporná druhá.\n\n       Kladná\nCS:GO zabaví na hodně dlouho\n\nV CS:GO je spousta módu map a věci skinů - bohatý obsah\n\nNové updaty jsou dobré jen se na některý musíme zvyknout\n\nTvůrci přidali jednu takovou už starší věc jménem Primární účet kde můžete hrát s hráčema co mají taky toto je to věc která snižuje počet hackerů a trolleru ve hře protože když dostanou ban na primární účet nemůžou ho mít podruhé teda někdy jo pokuď mají rodinu co má milion telefonních čísel ale aspoň se pokusili jinak by to ani nešlo vyřešit\n\nCS:GO je hra která je v něčem speciální prostě každá hra má své kouzlo tato hra je o taktice týmu komunikaci a dohodnutí se a toto je obrovské plus protože v jiných hrách toto moc neuvidíte\n\n       Záporná\nTvůrci sice dávají updaty ale neupravují věci které by se rozhodně měli opravit ale vývojáři je přehlíží- rozbité hitboxi , dýmovnice , a nekteré animace a zvuky ale ty animace a zvuky se teď opravují tak jim to prominem\n\nVelké množství dětí nebo ruských lidí nebo hackerů nebo trolleru který vám kazý požitek ze hry\n\nČasem co budete hrát vás CS:GO bude štvát protože budete vidět ty chyby a budou vás štvát velmi\n\nLidi vás někdy tak naštvou že můžete chytit rage a jako já si rozbít klávesu space naštěstí už mám novou :D ale je to mínus i hry i lidí jaká je komunita taková je hra...A je to celkem škoda\n\n----------------------\nTak zatím mě nic nenapadá dalšího až něco napadne dopíšu to.\n\nCelkové hodnocení 8.5/10\n     Osobně hru doporučuji jen ji něco málo musíte odpustit\n       \n Hodnocení se může změnit ale to záleží jak tvůrci hru zlepší",
  "Ze začátku těžší hra, ale pokud jste hráli nějaké střílečky docela OK. Dobrá grafika, ale hrozná komunita. Také hrozná situace je s cheatingem, obzvlášť na non-prime. Ale jinak rozhodně doporučuji.\nShrnutí:\nGrafika:       3,8/5   Grafika v pohodě,občas nějaké ty bugy \nHratelnost:  2,5/5   Ovládání OK, ale problémy s cheatingem a komunitou\nHodnocení: 3,4/5   Dobrá,strategická hra, ale problémy se určitě najdou (VAC systém atd.)",
  "Super hra zabaví na dlouhou dobu skoda že jí dali free",
  "Super hra která se z vás nesnaží vysát peníze a má super hitboxy. 👌👍",
  "Hra mi přijde velice kvalitní a na její stáří skvěle optimalizovaná a stále zabavná",
  "Hra splní očekávání snad každého hráče. Neznám snad nikoho v mém věku, kdo by CS:GO neznal. Vždy jsou názory na hru hlavně kladné. Obsahuje spoustu zábavných módů. Doporučuji zahrát si s kamarády!",
  "Best hra! Odporúčam len s prime-om inač sa to nedá hrať :)\n\nEDIT: Vždy keď si povieš že už nehráš tu hru tak na ďalší deň ju hraješ znova...",
  "Až na hackery a občasné bugy je i přes svůj věk špičkou her :)",
  "Dle mého názoru je hraj dobrá od té doby co přibylo nových hráču je hral lepší :D",
  "Dobrá hra by to byla, kdyby nebyla zadarmo. Pokud nemáte prime účet, tak je skoro 100% šance že narazíte na heackera.",
  "jednoduch hra ktoru ked sa naučite a mate good pc tak budete v  tom velmy dobry",
  "Nice game,sometimes u rage but u have to stay calm .)",
  "Pokud chcete skončit v nemocnici hra pro vás .  :-)",
  "Velmi dobrá hra, ale ocenil bych aby tam nebyli cheatři",
  "Jakoby, nebudu lhát. Někdy mě ta hra strašně štve, ale zase na druhou stranu je zábavná a dobře vytvořená.",
  "Velmi krásná hra. Tato nádherná hra Vás bude stát jenom pár klávesnic, rozbitých stolů a několik tuctů myší. Bez více Hz monitoru je to pouze plácání se v bahně s tím, že za několik chvilek Vám přiletí hlava zprava i zleva a Vám nezůstane nic, než se divit co je to kurva za hru a plánovat skok z okna, pokud teda nežijete ve sklepě jako já. V tom případě Vám zbývá všechny ty ruské spoluhráče s nadšením poslouchat. Hra skvělá, komunita K.Očko. PS: No skin no skill samozřejmě.",
  "Veľa ľudí na to nadáva  ale aj tak to všetci budeme stále hrať",
  "ze zacatku top hra a postupem casu se z toho stal jen biznis kdy hra postrada poradnou ochranu , tolik penez vydelavaji a nic ztoho ..\n",
  "[h1]KOLEM 1500 HODIN PŘESTANE BAVIT[/h1]\nHra se poslední dobou stává nehratelnou, nevybalancovanou. Po druhé bych ji nekoupil. Čím víc lidí si kupuje CS:GO tím horší hra to je, takže vás snažně prosím: [b]NEKUPUJTE TO[/b], ať to zůstane alespoň trošku hratelné.\nCelkové hodnocení 57%.\nPokud vám tato krátká, ale užitečná recenze nestačí a rádi čtete, tak na vás jsem taky nezapomněl :)\n\nCs:go mám asi 2 roky a nahraných cca 1500 hodin. Dřív to byla vážně skvělá hra, která zabavila na několik desítek hodin. Bohužel s přibývajícím časem vidím i mínusy, které tato hra má. Největší plus, který pro mě tato hra má - to že si vyděláte eura, je postupně vytlačován a hra mě začíná opravdu nudit a štvát. Koupil jsme ji za 10eur a vlastní snahou (žádný super drop z krabic) jsem si vydělat asi 70eur. To je podle mě opravdu úžasné. Samozřejmě si můžete vydělat i víc, pokud otevřete bednu a budete mít takové štěstí, že vám padne nůž (s 0,0xxxx% dropem) s kupní cenou 300eur. Já takové štěstí neměl :) Celkově bych hru shrnul asi takto:\n+ množství skinů\n+ skiny lze získat dropem\n+ je to hra, která vám může opravdu vydělat.\n+ turnaje, z nichž můžete dostat suvenýr bedny s cenou i 30eur\n+ komunitní mapy/módy\n\n\n- RUSÁCI A POLÁCI\n- smurf hráči, mající nahranejch 8 hodin a hrajcí lépe než celý vás team dohromady.\n- Valve\n\nCo vám zaručeně zkazí den je, když se logne připojíte do hry a zjistíte, že zase máte tým plnej rusáků nebo poláků. Samozřejmě dětí < 12 let. Ti hned začnou probírat vojenskou situaci Ruska a co bylo k obědu ve školní kuchyni. Vy samozřejmě ruzumíte pouze kur*a a cy*a blyat, ale informace o pohybu nepřátel prostě nedostanete. \nValve které vydává čím dál horší aktualice, hra se seká čím dál víc (operační mapy hrajeme přibližně na 1/2 fps oproti starým mapám) a to je tam operace 1 měsíc. Nějaký fix v nedohlednu.\n\n\n\nCelkově to s hrou jde dle mého názoru z kopce, stále má však co nabídnou a pokud budete hrát s přáteli, tak na nějakou dobu zabaví a můžete si slušně vydělat. Pokud však budete hrát sami ... připravte se na nové, upovídané ruské kamarády a vaše tekoucí nervy :)",
  "Hra CSGO se mi líbí, ale jediná věc která mně celkem odrazuje hraní této hry, je že tam je hodně Cheaterů, takže doporučuji si ten prime nekupovat a počkat si, až doděláte lvl 21",
  "Mega dobrá hra strašne sa mi páči,len treba updaty robit",
  "best fps game ever i lost 2 acc but i still bought ut :D",
  "Counter Strike Global Offensive je hra o spolupráci s teamem a o střílení. Tato hra zavítala ohromým hypem a byla v tu dobu jedna z nejhranějších svého typu kategorie. Jak ubíhaly roky tak hra velice nabírala síly a vývojáři oslabily své takzvané updaty. Tímto se dostáváme k mé recenzi.\n\nO čem to je?\n\nTakže tato hra nabízí hodně modů, a nejpopulárnější jsou Kompetetivní a Batr ve zbrani. v těchto modech jste proti nepřítelům a musíte je zneškodnit a to je celý cíl hry. Do hry si můžete kupovat takzvané skiny ale málokdo se doplatí a jsou vlastně zbytěčné ( jako třeba já ).\n\nNáhled na komunitu a cheating?\n\nKomunita sama osobě je hodně velká a to znamená že je tam velice hodně lidí kteří jsou pedofilové, ruský aneb polský překladač a hlavně takzvaných grieferů, kteří vám dokážou nejen zníčit hru ale ne jen to klidně i celý den možná i život. \nCheateři taky nazývaný jako podvodníci jsou lidi kteří buď podvádí pro zábavu aneb jen kvůli tomu že nezvládají umírání od nepřátel. Co se týče cheatingu v této hře, cheating je jeden z největších kdy byl zaznamenám. A kvůli tomu si ani nezahrajete pomalu jak jsem zmínil minule, kompetetivní aneb Bratr se zbrani.\n\nHratelnost a hitboxy ( zona pro střelu nepřítele) :\n\nHratelnost je velice dobrá, lehké ovládání a hlavně velice dobré Workshop mapy které vás tuto hru dokážou naučit. Kdybych nebral podvodníky tato hra by byla jako růženka na stromě.\nhitoboxy jsou to nejhorší co můžete potkat a na to řeknu jedinou věc abych se tu neunesl. \n    -Střelíš do hlavy nic, Za skoku dá pic- \n\nSouhrn:\n\nKdyž už si kupujete hru zapřemýšlejte jestli vás bude bavit protože koupit si ji není jen tak. Hlavně jestli nejste vždy klidný člověk nemá cenu se rozčilovat u kompetetivních zápasů a v bratr ve zbrani radši za hrajte toto. Komunitní servery- jedna velká listina zábavy, dobré komunity z 98% a velice dobrých modů které lze si můžete zde zahrát např. 1V1, USP only, Mirage only, AWP only a tak dále. Za mne hra boduje v komunitních server jinak celkově hru doporučuji!\n\nNázvy nejlepších českých komunitních serverů:\n1.FunPlay\n2.GameSites",
  "Feel free to make an offer \n\nhttps://steamcommunity.com/tradeoffer/new/?partner=136357209&token=0A_vaMhB",
  "Výborná hra dokáže zabavit na dlouhou dobu soudě podle hodin určitě doporučuji\n",
  "Cool shooter with absolutely no sense when it comes to weapon damage but its really fun so i recommend it",
  "Proč ne, sice spousta chyb. Ale s kamarády na zabávu je to dobrá věc. Jo a lepší by bylo vyřešit některé mechanismy herního enginu. 32-bit je už středověká metoda a kdyby to nepapalo drasticky jen výkon jednoho jádra bylo by to lepší. Jo mám AMD z roku 2014 a pociťuji to...",
  "Nice game, but anticheat? We will not talk about that :(.",
  "like this game but dont like cheaters and toxic people",
  "Starý dobrý counter strike v novom kabáte. Valve sa snaží o hru starať a pri naša nové veci a updaty ktoré sa ale nemusia páčiť každému, tiež sa snaží bojovať proti cheaterom tým, že dal hru free to play a vytvoril dve kategórie: Prime a nonprime. Prime je hlavne pre legit ľudí ktorý si chcú užiť hru len s tým rozdielom ,že stojí peniaze alebo musíte hrať dostatočne dlho do úrovne 21 kým sa Vám otvorí prístup čo nie vždy je ľahké keďže na nonprime sú cheatery na každom rohu. 4.5/5 strýkov odporúča.",
  "One of the best competitive games  I have ever played.",
  "Doporučuji, ikdyž ze začátku je to docela těžké, tak ale zlepšujeme se.",
  "CS:GO těžko třeba představovat. Pokud někdy Valve dokáže vyřešit hackery, bude to úplná pecka.",
  "Je to za me velmi dobra hra hraju ji dlouho  a furt me bavi",
  "Velice zábavná hra ale někdy mi vadí ti hackeři ale jinak pecka",
  "hru bych doporučil všem kdo chtějí hrát akční e sport hru",
  "Je to super hra jen mě serou ti hekři ale ty jsou v šude za me 8/10",
  "Nevim kde je unban takze ne mam permu uz pres 100 dni a jeste mi to nechtej zrusit vím moje věc že mám permu ale co",
  "cs go je vylepsena klasika 1.6. system kompetu a postupne pridavani ruznych hernich modu je parada. super jsou operace,akorat jich je malo. problemy s cheaterama,ale ty jsou snad vsude. jinak proste pecka :)",
  "Celkom fajn hra len by to chcelo aby sa Valve o to viac zaujímalo a nekašlali na to.",
  "hra je super ale když je v ke skoro každém kole hacker ttak je to fakt kundovina",
  "Je to pičovina s toxickou rusko-polskou komunitou. Ked nemáš rád život stahuj :) + Ked hráš proti turkom na DUST II si skončil bo ich toxicita ťa rozjebe. :*",
  "Je to gud hra dokud nepotkáte rusáka s vodkou a hackama",
  "Cisti scam ak ste chudobni tak si len kupujte skini za 3 centy lebo z caseky dostanete to iste ale stoi to 100x viac",
  "With friends its really fun. Its verry good game please play it trust me.",
  "Great game for reflexes etc.. and with friends too :-), beware, sometimes is someone just better than you",
  "Hra je velmi dobrá, bohužel lepší je hrát v týmu než náhodný matchmaking.",
  "After 1000 hours of stress, bad teammates and loss half of braincells, Very quality game :DD",
  "Je to velmi zábavná hra, užil jsem si s ní spoustu zážitků.",
  "líbí se mi tady poměrně vše ale i přes to že mám odehráno 834 hodin hraní pořád mi hrála nedala nějaký pěkný unikátní skin",
  "Velmi chytlavá, a mainstream gameska.\nHraju každej den.",
  "Hra je dobrá, zařadil bych ji mezi hlavní hry e-sportu. Stále se drží klasické lajny Counter Strike, avšak mi přijde, že Valve z toho začínají rýžovat jak jen jde a posouvají hru, pro mě záporně, směrem Battle Royale. Herní operací je znatelně méně jako dříve, ačkoli jedna zrovna po dvou letech pauzy běží. Bylo odebraných spoustu dobrých map, i když jich bylo pár dalších přidaných. Na mapách došlo i k hromadě změnám, které jsou jak kladné, tak i záporné. Přijde mi, že se o hru Valve stará méně jako před tím.",
  "Když nemáš vůbec co a už tě nic nenapadá tak tohle na tu chvilku zabaví",
  "Doporučuji dobrá hratelnost a zábava když máte s kým",
  "Prostě nesmrtelná hra co víc říct. :)\n\nImmortal game <3",
  "tato hra je hodně o skillu ale když nejste ragerři doporučuji :)",
  "Dáš OneTap jsi cheater ,jsi první v tabulce --> cheater, <.....Luckyskills.....> je realita :D \nNávyková hra ,kde zjistíte co je mít nervy fakt v píči :D\n\n\nI love CS:GO..........",
  "Jsem trošku schizofrenik, takže online nehraju. \nProč? Všichni podvádí a cheatujou (jsou lepší než já)\n\nTak si to kompenzuju na nebohých bótech :D A výsledek? \n\nSupr hra, super střílečka! :) \n\n---\nJE MI AŽ PROTI SRSTI TA KOMERČNOST (VYCHCANOST) VÝVOJÁŘŮ.... jako za blbosti typu rukavice, atd takový peníze?\nTo určitě! Děkuji nechci. Kolikrát dražší než hra jako taková :D Krom toho, v mém případě je bótům jedno co mám na sobě ne? :D :D",
  "I dont know what to say this game is legendary i love it but somethimes iam so pissed off! Anyway i can recommend this game<3",
  "Je to veľmi dobrá hra jediné - je to že je tam strašne veľa cheaterov.",
  "Hra je mega v pohodě ale často narazíte na hodně nepříjemný a otravný lidi. Po 10 komúetech jsem přemýšlel nad svím životem zda má furt hodnotu.",
  "very good game but too much cheaters and this skin system is so bad i think",
  "Counter-Strike: Global Offensive je jedna z nejlepších kooperativních stříleček ze všech.",
  "This game...\n1. ...ruined my real life\n2. ...ruined my family\n3. ...is the reason why i have no girlfriend\n4. ...ruined my school\n5. ...destroyed my head\n6. ...makes me tilt\n7. ...has so many toxic players\n8. ...has so many cheaters\n9. ...f*cks my mind\n10. ...makes me fat\n\n\n10/10 would do it again",
  "Od CS 1.3 až po CS:GO a stále věrný. Až na ten anticheat to už by VALVE mělo fakt radikálně řešit!",
  "Dobrá hra, zabaví ve volném čase, ačkoliv jsou tam hackeři kteří vám zničí psychiku :DDD",
  "kdyby to nebylo FREE tak je to EXCELENTI hra, ale bohuzel, Gaben to posral . . .",
  "Asi není, kdo by neznal CSko, hru, která se těší neuvěřitelné popularitě už přes 20 let od svých počátků.\n\nHlavní je zde hratelnost, ve které CS:GO rozhodně dominuje ve svém žánru. Hra vyždímá vaše reflexy do poslední kapky. Smrt a úspěch oddělují milisekundy, každá nepozornost se vám vymstí. \n\nMapy jsou skvěle navrhnuté a promyšlené do posledního detailu, baví vás i stovky hodin, nikdy neomrzí a nemáte pocity, že by se dělo dokola to samé. Pořád se dají hledat a učit nové taktiky a tak dále.\n\nHerní mechaniky jsou náročné a vyžadují tvrdý trénink, než je pořádně ovládnete a rozhodně nejsou nic pro hráče zvyklé na “náročnost” Call of Duty nebo Battlefieldu. Každá zbraň má unikátní chování a rozhodně nečekejte, že jej dostanete do ruky během několika desítek hodin.\n\nCo se týče grafiky, tak ta není bůhví jak nádherná. Což u těchto her není vůbec potřeba. Při likvidování nepřátel, nebudete mít ani čas kochat se prostředím. Důraz je kladen na hratelnost a svižné tempo, grafické zpracování ale neurazí.\n\nBleskové tempo, intenzivní gameplay a těžké mechaniky dělají hru nesmírně návykovou. Pokud jste CS:GO ještě nehráli, tak nemůže tvrdit o své herní kolekci, že je úplná. Snad nejchytlavější hra vůbec, kterou jsem kdy hrál. I když už se jí dávno nevěnuju, rád se k ní pokaždé vrátím. \n\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀   Nestárnoucí legenda\n⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀    10/10",
  "co k tomu říct je to mega popiči hra rozhodne doporucuju",
  "je to velice kvalitní hra plných cheaterů. Já mám prime ale stále mám každou hru proti sobě cheatery. Gj VALVE.\nVelice doporučuji",
  "myslím si že je to velmi dobrá hra až tehdy kdy máte ZAKOUPENÝ PRIME ÚČET ale i na primu cheatujou a jsou tam pořád uřvaný ruský kidi takže je toee jedno 10/10",
  "Valve is bad, they give me vac error, but i dont have any cheats :) FUCK OFF",
  "very good boris aproves boris loves talk rusan boris good at team play  boris good player",
  "Very good teamplay game! BUT VERY MUCH CHEATERS.\nIF U WANT PLAY WITH FRiends go to faceit",
  "Dobrá hra jen dopoledne kdy jsou kidi ve škole :D :pandastunned: :pandastunned: :pandastunned:",
  "Celkem to ujde.. když nehraješ MM, ale jakmile ho zapneš tak máš chuť to odinstalovat a radši si zahrát Robl0x",
  "Velmi zabavné. Má své mouchy ale když to přehlédnem 9/10.",
  "Well...\nNice game but comunity is horrible. I mean..if u re going to play some game in 98.9% of games some kid or russian is speaking to u and saying u: \" noob...\" but that kid is last in leaderboard.\nBut as game with friend its nice pick :) .\nFix anticheat,cooldown,smurfs,and fps in some maps (i mean new cache..ugh..)\nIf Valve fix everything in this game, it can be new best played game i think :) \n",
  "Doporučuji tuhle hru kvůli tomu že je to multiplayer a ty mě baví",
  "Nejvíc v pohodě hra.Jediný co je na ní špatný jsou hackeři jinak je to good game.",
  "Škoda, že je to Free to play, je tam na non prime moc hackerů, ale po aktivaci primu statusu je hra o hodně lepší, skoro žádnej cheater, žádnej nubak xddddd recenze jen kvuli steam lvl",
  "Tato hra je skvělá až na to že tam hrajou cheateři a chtělop by to lepší anti hceat.",
  "Nejlepší hra na světe :)(Best game in the world :))",
  "Skvělá hra, když nedostaneš 4 ruský dětska do týmu. 9/10",
  "Dobrý den, chtěl bych se zeptat jestli by jste nemohli zrušit penalizaci ve vaší hře CS:GO mému kamarádovi, protože když se mnou hrál, tak mu spadla hra a počítač nešel zapnout. Proto bych vás chtěl poprosit jestli by jste mu tu penalizaci nezrušili nebo zkrátili. Děkuji hezký den. @thomas_edits\n",
  "GOOD GAME TO PLAY WITH FRIENDS, BUT I DON'T HAVE FRIENDS, SO ACTUALLY IT'S BAD GAME.\nI'LL RATE IT 11/10",
  "Perfktná hra.\nMusím povedať že ma nemilo prekvapila.\n",
  "[url=https://www.youtube.com/watch?v=dQw4w9WgXcQ]\nSometimes ragequit\n [/url]",
  "pičovina skurvená furt mám pri tom nervy ako kokot ale baví ma to",
  "Very good russian simulator and good joke with  anti-cheat\nOn minecraft servers is better anti-cheat Fix it please",
  "Player Bases.\n☐ Kids.\n☑ Everyone.\n☐ Mature.\n☐ Casual Players.\n☐ Pro players.\n\nGraphics.\n☐ Potato.\n☐ Really Bad.\n☐ Bad.\n☐ OK.\n☐ Good.\n☑ Beautiful.\n☐ Masterpiece.\n\nPrice.\n☑ Full Price.\n☐ Wait For Sale.\n☐ Refund It If You Can.\n☐ Don't Buy It.\n☐ Free.\n\nRequirements.\n☐ Minimum.\n☐ Medium.\n☑ Fast.\n☐ High End.\n☐ Super Computer.\n\nDifficulty.\n☐ Easy.\n☐ Medium.\n☑ Hard.\n☐ Very Hard. (This game can be REALLY HARD)\n☐ Death March.\n☐ Dark Souls. (when you found pro player)\n\nGame length.\n☐ Really Short. ( 0 - 2 hours)\n☑ Short. ( 2 - 8 hours)\n☐ Medium. ( 8 - 16 hours) (it has an Endless option)\n☐ Long. ( 16+ hours)\n☐ Endless.\n\nStory.\n☑ It Doesn't Have One.\n☐ Horrible.\n☐ Ok.\n☐ Average.\n☐ Good.\n☐ Fantastic.\n\nCinematic/Art.\n☑ It Doesn't Have.\n☐ Horrible.\n☐ Ok.\n☐ Average.\n☐ Good.\n☐Like Watching A Movie.\n\nMusic/Sound.\n☐ Horrible.\n☐ Decent.\n☐ Average.\n☐ Good.\n☑ Amazing.\n\nGameplay.\n☐ Terrible.\n☐ Ok.\n☐ Average.\n☑ Good.\n☐ Fantastic.\n\nBugs.\n☐ Game Itself Is One Big BUG.\n☐ Game Breaking Bugs.\n☐ Lots of bugs.\n☑ Few Bugs.\n☐ Nothing.\n\nOthers.\nMultiplayer: ☑\nSingleplayer: ☑\n\nFinal Score:\n9/10",
  "milujem tuto hru hrávam ju dlho som dievča čo len dokazuje že baby nebojte sa je to super",
  "CSGO.. no.. jak bych to řekl.. Je to prostě hra, která vám dokáže jak zlepšit náladu, tak solidně na*rat. \nPokud máte normální Steam účet a necheatujete, budete mít v pohodě Trust a hra bude sranda - dobří spoluhráči apod. \nS cheatery osobně žádný problém nemám a to ani nejsem na Steamu nějak dlouho, jen prostě necheatuju na altech apod. \nGL&HF",
  "nej hra porad me bavi od ty doby co jsem to zapnul je to mnohem lepsi nez fortnite atd \n",
  "Je to dobrá hra pokud nechytnete rusaky nebo cheatery\n",
  "Je to fajn na oddych, když hrajete jiný hry jako je lolko xd",
  "Super hra ale bez PRIME to vubec nejde pokud nekdo neni muj bratr co ma snad nejvissi trust a od zacatku co to ma bez PRIME tak nepotkal hackera :D. Ja koupil prime po 1 hře dethmatche",
  "Super hra, občas jsou proti vám lepší hráči než jste vy, a nejsou to hackeři :)",
  "Dobrý den, jelikož mám rád horory vybral jsem jsi hur CS:GO jelikož je mrtvá.",
  "Výborná akční střílečka. Skvělý design herních prvků. Super map pool. Tuto hru velmi doporučují i.",
  "This is very good ggame like me englando sooo dont play this game because you can brake keyboard or mouse like škrr idk Naruto Užkučuky frrrrrrrrrrrrr like kotoučky Donut Trumpeta is very good dancer like michael jackson protože pičo černa plět je tam nejlpší plět NO rasicsm idk how to write i can speek litle germany like ich bin Gamer like Babica or Ich bin idiot from Čeko Republiko",
  "country strike je dobrá hra, ale je v ní mnoho cheaterů!\nmůžete si na začátku kola zakoupit zbran a pak už se jen pustit do boje!",
  "I když se u té hry člověk často nasere tak je to celkem fajn",
  "+ Good maps\n+ So many different skins\n+ Creative fan base\n\n- Sometimes you will meet a cheater\n- A lot of mad russian people\n- Valve don't care",
  "super odporucam mam nahratych 800 hodin a stale ma to bavy",
  "I spent 500€ in this game! I got no money now :( HELP ME!!!!!!!! I GOT NO SKILL WITH SKINS. Gaben help me.",
  "Dobrá hra, ale náhodný matchmaking je něco jako gambling může vám to dát úžasné teamety nebo něco co nedokáže chodit.",
  "Myslím si že je to pořád dobrá hra, ale ten prime je stejně s cheaterama, ano Valve píše že je to lepší, to sice ano, ale stejně najdete cheatery proti sobě. Nejhorší je, že prostě se snažíte hrát co nejlépe tuto hru, ale dá vám to cheatera a jste v pr****.",
  "No čo povedať hra je dobrá.\nIba keby tam nieje tolko cheatru :/",
  "Na CS jsem kdysi začínal ještě v hernách před 10 lety. Poté jsem dlouho hrál sérii CoD ( převážně CoD1 kde komunita poslední dobou již odpadla a hra se téměř nehraje ) proto jsem hledal alternativu a to co jsem našel v CS GO mě až překvapilo. Takových možností hraní, úprav zbraní soutěží atd. To se mě ani nezdálo. Naprosto skvělá hra ikdyž jsem byl zvyklý na jiný styl hraní, míření a leanování, tak na tohle se dá zvyknout celkem dobře.\n\nOvšem nevýhoda je, že Vá to může pohltit! Za cca 2 měsíce 500 hodin, to je skoro jak za mlada CoD :D",
  "Okey tak že Couter Strike celko hrám asi 4 roky vedel som že skoro každá hra ma svoje muchy ale nečakal som že CSGO bude zadarmo a že v ňom bude na každom rohu tolko cheaterou. Aj keď je možnosť zakúpiť si prime tak sa to neoplatí pretože aj na prime účte nájdete veľké množstvo cheaterou to ma veľmi neteší pokiaľ bola táto hra platená tak tam boli veľmi málo cheaterou a bavilo ma ju hrať no teraz sa to už nedá hrať.",
  "Nejvíc najetá hra.. Dávám 10 z 10 bludišťáků! A hraje to i Chlumečák :)",
  "Super hra, ale od doby co je free... tak je ve hře moc hackerů",
  "K týhle hře neni co dodat nahraný hodiny mluvěj za vše. Dokonalá aim-rage hra pokud máte doma nadbytek klávesnic a monitorů neni nic lepšího na otestování odolnosti. Durability test počítačové techniky 10/10.",
  "*recenzi jsem se rozhodl napsat k pokoření hranice 3 000 hodin, tedy přesně 125 dní čistě strávených hraním CS:GO\n\nHru jsem koupil ve slevě přibližně za 5€ na doporučení kamaráda před 5 lety. Musím uznat, že za tu dobu prošla hra velkým vývojem (ovšem ne vždy tím správným směrem). Na CS:GO jsem přešel z Battlefield multiplayeru a začátky byly hodně krušný. Oboje mají úplně rozdílný styl hraní a strategie.\nVždycky jsem si říkal, že to hraju pro zábavu, ale v 70% případů jsem odcházel ještě víc nas*anej =)\nKaždý si hodně stěžoval na hackery, ale já osobně jsem na moc hackerů nenarazil (mám prime status).\n\nPokud chcete dosáhnout ranku Global Elite, bez týmu či pár kamarádů to nedáte. Normální spoluhráči se objeví tak ve 2 z 10 her. V ostatních hrách potkáme polské kudy, ožralý Rusáky, uslyšíte Bulhara, kde v pozadí bude slyšet jeho 15ti členná rodina a ještě tam na vás bude řvát Turek, další bude hrát vedle vodní turbíny nebo vysavače, protože ho vůbec neuslyšíte. Sice se hodně nadává na Poláky nebo Rusáky, ale už několikrát jsem se přesvědčil, že radší Poláka, než Čecha nebo Slováka. Ale i takový britský gentleman je jen mylná představa.\n\nPokud chcete lepší zážitek ze hry, rozhodně stojí za zkoušku FaceIt nebo ESEA, tam si zahrajete na 128 tickových serverech.\n\nUž nejde o zlepšení hry jako spíš o to, že hra je stále populární, tak na tom vyděláme každou korunu. Proto je každou chvíli nová bedna, jen aby rychle všichni šli koupit klíče a hurá otevírat =)",
  "Velice dobrá hra, hlavně když chcete hrát s kámoši.",
  "Jedna z nejlepších competativních her prostě LEGENDA.",
  " wseipof pweiojfp wepoú rkwpwepreo porsdkg pmd pqfm rwqefdf",
  "if rusians learn how to speak eng and cooperate its good game",
  "Hra je dobrá a zabaví vás na hodně hodin.\nKdyž hrajete na no-prime tak si vubec nezahrajete. \nKomunita u téhle hry je velmi zajímavá, občas je velmi zábavná, ale občas velmi nepříjemná a mám chuť hru přestat hrát, ale vždy se k ní vrátím. Myslím si že víc srandy zažijete na komunitních serverech např.: jailbreak, surf, 1v1 areny, bhop, atd.\nHru doporučuji zažijete hodně zábavy.",
  "Před hraním bych všem prvotně zkontroloval mikrofony, protože to co někdy slyšim je hruza :D",
  "Je to dobrá hra i po těch letech tak že. \n\n\ngl hf všem :D\n",
  "Dobrá týmová hra, která mě zabavila na dost dlouhou dobu. Jen se tu a tam najde nějaký podezřelý hráč na cheating.",
  "Super hra hlavne tymova ale obcas bouzel nevyvazena",
  "je to good gamesa,akorát škoda že jsou tam zaplí týpci",
  "Hra kvalitní.\nBohužel anticheat je hrozný. Myslel jsem si,že když budu mít hru koupenou,tak se vyhnu hrám s nonprime účty,ale nestalo se tak. Trust factor je podivuhodná věc...\nKdybych byl úplný nováček tak mi tahle skutečnost zkazí celkový dojem z hry.",
  "Až na hitboxi super hra XD. Nic pro lidi se slabou vůlí.",
  "Je to super hra,každý ji zná ale je plná děcek jako jsi ty a rusáků co nekomunikují a hrajou jak píča thx lmao :*",
  "Tato hra je zábavná hlavně komutativni a zajímavě kreativní",
  "Dobrá hra, jen vylepšit anticheat, ale vím že to dá zabrat.",
  "furt RAGE ale dá sa to aj keď kupujem furt klávesnice a myšky....",
  "Co dodat, každý tu hru zná a ví jak to u té hry chodí, co krok to chearter",
  "Counter Strike: Global y je dobrá hra až na výjimky což jsou hackeři, blbý spoluhráči s 20iq jak tykve, a blbý Vac systém který občas chybuje",
  "Je to velmi strategická hra ktorá má tolko módv že by ste to ani netušili",
  "Hra která je dobrá ale i zároveň špatná. Když už si chcete užít hru tak potkáte nějaké toxic hráče kteří vám budou kazit hru klidně jenom kvůli tomu že hodíte špatně smoke, ale tak co očekávat. Je to dobrá hra, taková na nervy :D",
  "Super jen je škoda že tam je víc cheaterů než legitů a víc rusáků než normálních hráčů",
  "᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌ ᠌𝙂𝙧𝙚𝙖𝙩 𝙜𝙖𝙢𝙚, 𝙧𝙪𝙞𝙣𝙚𝙙 𝙗𝙮 𝙘𝙝𝙚𝙖𝙩𝙚𝙧𝙨.",
  "I'am playing CS GO for 3 years. I definitely recommend this game.",
  "Hello, please go play CS:GO, is very good game :D \n",
  "Tuto hru hodnotím kladně jako babičky kotlíkový guláš\n",
  "Je to výborná hra pro více hráču ale je zde potřeba být bystrí a nenechat se jen tak naštvat. Non Prime učet j plný hackeru ale já jseem na Prime učtu narazil jen na pár. za mě výborná hra.",
  "na ty hře je dobre že vypada to relysticky a davaj tam aspon nějaky mody ale v 1.6 za tuhle dobu nedali žadny mod je to husty skiny a všechno",
  "Hra je dobrá ale když to dali zadarmo tak jsou tady samí hackeři. :( \nPodle mě by CSGO  měli dát za 5€ minimálně.",
  "Good for play with friends but not with rage players",
  "This game is still live and finaly some new updatese",
  "Velmi dobrá hra myslíte že se odreagujete a naopak se víc naberete\n",
  "Tato hra je velmi dobrá, ale občas ma moji kamarádi serou you know :)\n",
  "SKVĚLÁ HRA ALE ŠTVOU MĚ TI CHEATŘI JINAK BEST HRA EVER",
  "Chcete li se nasrat u hry zahrajte si tuhle je tu spousta cheateru a Steam s tím nice nedělá protože si hrabe kapsy a zároveň tu hrají smurfici z novými účty tak si vlastně taky moc nezahrajete Steam to taky nezajímá další peníze do kapsy místo toho aby se snažily to tu zpříjemnit spíš dělají naopak ale ta hra vás i taky chytí a nějak to člověk vždycky vydrží",
  "Tato hra, ikdyž ji hraju na jiným účtě tak mě nikdy nepřestala bavit, sám se divím že tato hra pořad žije :D",
  "Po škole nebo po práci je to skvělé na odreagování, i když se může zdát, že se nestaly žádné radikální změny, tak opak je pravdou. Kompetitvní hraní dodalo hře novou úroveň a to i skiny. Rozhodně to přidalo na zábavnosti. Řekl bych, že jsou to kvalitně investované peníze .... A když jí koupíte ve slevě, tak pomocí skinů, na ní můžete klidně našetřit :D :)",
  "Vysoce kvalitní hra s nerozbitým rankup systémem, jestli tam tedy vůbec nějaký je :) \nCS:GO by mohlo také simulovat vrtulníky, tolik vrtulek jako v této hře jinde nenajdete, tak šup pro prime a hrát.",
  "super hra ale pirme je od 21 levlu a nebo si ho koupi jinak tam je hackeru jako prase\n",
  "tahle hra je neskutečná mrdka a rozhodně bych těch 1100 hodin radši věnoval něčemu jinýmu. poggers feelswatedman:ccc\n",
  "Velmi dobra, ale zial casto clovek natrafi na Cheatera :(",
  "doporučuji. celkem dost zabvna hra. jen do te doby co neschytate cheatery. ale kdyz si koupite premium nebo dosahnete lvl 40 tak by se to nemelo zkoro vubec dit\n",
  "Sice mam vac ani nevím za co ale tato hra mně byvila",
  "Jako do každé hry byl přidán battlepass ale chápu a tady myslím že je i fajn",
  "If someone is good in that game and catches noob from the beginning from 5 rounds, they report him and he then has a reduced Trust factor. And then it's harder you fix it and increase it.\n\nbut this game belongs to my childhood so i came back to it too i always enjoyed it.",
  "velmi dobra hra hravam ju uz 3roky uplna spokojnost valve sa stara o tu hru velmi dobra hra odporucam",
  "Ale jako ujde to, hraju to už dlouho a jsou tam rusáci úplně všade. Karel to neumí hrát ale občas dá dobrou hlavu.",
  "Tato hra je dobrá, ale musíte si zvyknout že každou druhou hru máte proti sobě cheateri. Ale i tak tu miluji.",
  "It has come to life from the dead and it is a super game.",
  "až na pár Ruskejch cheatrů je to sranda,hlavně s kamarádama",
  "Je to jako droga. nenávidíš to, ale potřebuješ to..",
  "+very good game but sometimes hackers fucked up ! :-D",
  "Velmi dobře povedená taktická střílečka ! Do té doby dokuď se neobjeví hacker nebo blbej tým. Podle mě je hra málo chráněná proti hackerům. Ale je to ÚŽASNÁ HRA!",
  "Piece of shit game, with toxic community and greedy developer. I recommend.",
  "Klasická  všem známá střílečka, která vás může zabavit i na stovky hodin, avšak často až zbytečné updaty, které absolutně ignorují názor komunity a velmi častí hackeři, jak ve vašem nebo v protějším týmu dokážou zážitek ze hry absolutně zkazit. 7/10",
  "My girlfriend said, CSGO or her..\nAt this time she is my ex.",
  "hra je velmi dobrá a nabízí toho hodně.\nje zde ale hodně cheaterů!!!!!\n",
  "My favourite game but full of hackers, Valve need to do something more with hackers",
  "je to neskutecny dekujeme nikolas vlk a michal vořech",
  "best game ever ! :D mirage=lose !!!! best player is eomond \"Kekelakov syn\"",
  "nelíbí se mi že někteří hráči se jim nedaří a zapnou hacky a nikdo nic stim neuděla ani sama ta hra jenom dostane report a toho nepotrestá",
  "Dobrá hra, doporučuji ale zakoupit. Na neplacené verzi jsou často cheateři",
  "Lehce naučí ruské/polské nadávky. \nO cheatery a o zábavu s nima taky postaráno..\n10/10 vodek doporučuje.",
  "Velmi příjemná hra. Dá se u ní naštvat. Je zde dost toxic hráčů.",
  "Je to velice dobrá hra, když se nudíte a máte kamarády",
  "Hra byla skvělá. Ale nový update se nepovedl. Danger Zone podle mě CS:GO pohřbí. A s tím, že to je free to play, tak to přinese spoustu cheatrů. Je sice fajn, že je tady stále prime matchmaking ale i tak to mohli udělat ..,  jinak.  Hra je jinak dost dobrá a doporučuji.",
  "Opravdu super hra jen dobre hrat s kamošemi :))))))))))))))))))",
  "Super spoluhráč dobře si mi s ním hrálo dobrej Smurf 🤤😝\nGood player good smurf",
  "Kvalitní hra, rusáci a poláci jsou nejlepší co můžete potkat. Infarkt 11/10 lepší a lepší twl",
  "Good game, but everyone cheating. Please Valve Buy better anticheat please thank you \nBy Wertix",
  "Líbilo by se mi kdyby produkt byl za peníze a ne zadarmo",
  "CSGO,\nNebo-li hra plná ruské komunity s tzv. cheaty. Pokuď se chcete pěkně u nějaké hry nasrat stahněte si tuto mrtku.\nDěkuji za sebraných skoro 1000h mého života. \npac a pusu",
  "good game but add some skin when you achive better rank",
  "Máte dobrou náladu? Běžte si zahrát, ona Vás přejde.. ;)",
  "If u wanna teach russian=install game\nIf u wanna be best=uninstall game",
  "This game is sometimes fine but sometimes is pissing me off. I would like if there was less cheaters",
  "Skvělá kompetitivní hra, jediná hrozná věc na ní toxická ruská komunita která vás donutí se odpojit.",
  "dobrá hra ale když máte v týmu rusáky tak se to moc nedá",
  "Hraju to asi 3 000 hodin když počítám všechny účty . I když dostanete přes 3 zdi hlavu tak se možná hodně naserete ale nikdy vás ta hra neomrzí když už máte tak nad 100 h.",
  "po prve : zakazat tuto hru vo vyjebanom rusku pripicenom\npo druhe: do jednej sekundy dat ban za report \npo tretie: vratit skurvenych botov",
  "Game it self is good but the comunity is not so much. \n\nBut every other game but this is boring me. \n\n",
  "Co napsat asi nic ten kdo zná má svůj názor pro někoho je to super hra ale dokáže nasrat každého když se vám nedaří na tehle hře necháte nervy i hodiny hraní.......!!! Ale za mě doporučuji :D",
  "Je to hra plná zábavných a skvělých momentů. Třeba když na matchmakingu lítá hovado jako vrtulník to moc feeluju.",
  "ano ano dobra hra jen kdyby tam nebilo tolik cheateru",
  "Hra je výborná baví mě je to legenda. Můžu jenom doporučit",
  "Top hra, žádní cheateři, je to bez nervů a mužete to hrát i když jste nastvaní, uklidní vás to. xDDDD",
  "Skutečně dobře vytvořená hra, velice se mi líbí, doporučuji všem, kteří rádi ragujou.",
  "Po 220 hodinách hraní, jsem se konečně rozhodl napsat recenzi. Hra jako taková je jako sandbox z roku 2010, ale za to nevypadá špatně. Ve hře se nachází několik módů, kompetitivní, bratr ve zbrani, nenáročný, deathmatch, a ty ostatní jak já říkám už je jen ztráta času. Rád bych se ale rozpovídal o komunitě která se nachází v zápasech. Pokud jste non-prime, tak budete z 90% potkávat ruské ubrečené děti, kteří často i hackují, proto doporučuji koupit prime status upgrade. Ale i po koupi se sice to procento razantně zmenší, za to stále budete potkávat často hackery, kokoty, kokoty, kokoty, toxic rusáky, a nakonec kokoty. Šance že najdete dobrej tým, je asi jako šance že vám spadne z bedny nůž. Když už jsme u těch beden, to mě sere asi nejvíc. Valve místo toho aby updatoval anticheat, vylepšoval matchmaking, přepnul na 128 tick, source 2,  dalších tisíc sraček, které jdou udělat v jednom updatu, tak jenom přidává bedny, které bohužel děti a retardi otevírají, a valve z toho maj money. Bedny otevírají často i FACEIT hráči, takže ještě hůř. Samožřejmě, operace Brogen Fang, Shattered Web, a další, tak jsou skvělé a mam je rád, stále to není dostatek. Další point je, že kdyby komunita nezasáhla do hry, hra by naprosto umřela. Tím nemyslím ty ruské děti, ale ty, kteří dělají overwatche, různé mapy, a hlavně slavné osobnosti, kteři tuto hru hrají. Na konec bych ještě zopakoval že mě hra baví, ale chce to aby do toho valve alespoň trochu zasáhlo. Děkuji, to by bylo vše :)",
  "Very good game if you want to play with fucking rusha monkey",
  "i like the game but not peopple who plays the game.... no education and almost no knowlege about game on non prime, and on prime again no education about english language... sad",
  "Celkem super hra jen ti cheateři mi vadí no jinak super hra.",
  "Když nemáte nic na práci tak tahle hra je dobrá k zabavení",
  "Škoda že to hrajú deti s malými kokotmi co nemajú aim a musia mat cheaty",
  "Hra je velmi obsáhlá a příběhová, někdy přijdou i hororové scény, ale to k závodní hře patří",
  "Skvělá relaxační a uklidňující hra se skvělým anticheatem. Poskytuje herní zážitek té nejvyšší kvality s čistě anglicky mluvící komunitou 18+ lidí. Vřele doporučuji",
  "Cs:Go kvalitní střílečka kde můžeš získat zkušenosti co se týče aimu,akorát tato hra strádá kvůli hackerům trollům a  smurfům. Už je to praktický mrtvá hra  svoje doby už měla za sebou. 7,5/10",
  "je to kurva dobra hra ak chcete aby ste si zničili nervy tak doporučujem",
  "PIČO NEJLEPŠÍ KOMUNITA NA SVĚTĚ NA TOM CSKU! MILUJU TO",
  "CS:GO je taktická first person shooter hra. U této hry jsem strávil hodně času a ve své kategorii nemá konkurenci.",
  "je to dobrá hra ale má veľmi zlý anticheat a nie veľmi dobrý rankovací systém \nPRIME mal som ešte pred tý než bolo csgo zadarmo valve vám napíše že može te dostať exkluzívne skiny ale čo dostanete tak je 3 centový skin a komunita je tiež úplne suprová skoro všetci vás chcú okradnúť\n\nit's a good game but it has a very bad anticheat and not a very good ratchet system\nI had PRIME even before it was csgo free valve will write you that you can get exclusive skins but what you get is a 3 cent skin and the community is also completely super almost everyone wants to rob you",
  "Ano táto hra je doopravdová sračka, chci zdělit hráčům, aby tuto hru nezačínali, jinak pak budou nasraní jako já, že dostanou ban pro nic za nic a všechno je v píči.. a valve jsou jen zasrané zlatokopky, které doufají, že když vám dají ban tak si koupíte další acc... zasrané píče",
  "I like this game but I will be happy if you make good anti-cheat.",
  "csko ted nemuze umrit a nechat nas tu napospas valorantum",
  "fucking piece of shit this game is so bad oh my god im gonna fucking loose it ok now let me play another round",
  "Najlepšia hra na svete. : Best game ever on the world",
  "Its really good game with HUGE BUT!\nCheaters. These cocks are ruining this game. Valve should wake up and start doing something. Or just buy from FaceIT their anti cheat... Peace! <3",
  "Táto hra je len pre tryhard hráčov ktorý nemájú život, ale jak sa chcete psychicky tírať tak si túto hru 100% zahrajte. :)",
  "Taková hra ,u které můžes rozbít 4 monitory a stejně ji budeš hrát....",
  "Jednoduchá pravidla, složitější týmové strategie, fajn odreagování.",
  "Very good game.But when you play against cheaters or smurfs ahhh and with russians need no words.But basic game is good",
  "Hra dobrá, pokud nepotkáte nějaký toxic ruský suky :D",
  "Tato hra je občas totální cancer, ale když hrajete se svýma kámošema tak to může být zábava. 😂 Ale jinak tu hru doporučuji 👍 a přeji hodně štěstí XDDD",
  "Zdravím\nje to výborná hra co vás nepřestane bavit i po stovkách hodin minimálně když ji máte ským hrát ale když nemáte tak si snadno někoho najdete třeba přes doporučená lobby.Hra není drahá a nevyžaduje výkonný pc proto si ji můžete zahrát i na kalkulačce.ještě jedna věc je tam takzvaný prime který si musíte koupit protože hra v free to play nejde hrát protože je tam mega moc hackerů.\nPokud si hru koupíte tak hodně stěstí na bojišti přeju hodně povedených rushů a  získání nejvyššího ranku global elite.",
  "hra která vás naučí ruštinu arabajštinu.tak kde bych začal je to dobrá hra ale i špatná někdy potkáte fajn týpka ale potom rusák(většinou jsou to idioti) je to určitě zábava hlavně s kamarády a musíte znát anglištinu jinak to můžete rovnou zabalit když si nekoupíte prime učet tak jsou tam dost hackeru tak tohle je konec recenze a přeju pevný nervy.",
  "Je to sračka jak poleno a nikomu bych nedoporučil hrát jelikož vám to akorát sežere peníz jelikož si myslíte že vy budete zrovna ten komu padne vysněný nůž z jedné casey za 2 éčka",
  "Je to velice dobrá hra která není tak náročná proto dávám 9/10, jeden bod dávám dolů protože je tam hodně cheterů.",
  "Myslim si ze je to hra za ktoru hovoria dejny takze sa nemam k comu vyjadrovat...",
  "i realy love the vac system love it so much giving so many money to this game gaben i think you love my value",
  "kamoskovia yolo broskovia zahrajte si csgo je to topka aj je to lacne",
  "Musím říct že je to velmi dobrá hra ale toxic hráči no nic moc :D",
  "Sice je hra plná hackerů a Rusů, ale je to super hra!",
  "Jedna z nejlepších stříleček EVER\nPokud váháte nad koupí, neváhejte a kupte. Nic s tím nezkazíte\nJediná připomínka - 7denní bany, to je hrozný šit. Vypadne vám internet a ban, pak se můžete jedině jít klouzat.\n9/10 lišek doporučuje",
  "Nice.nice.very good game not ruský posly fucking cunt i realy enjoy this game but when i get Věry bad team ist shit",
  "Hra, ktorá dokáže ľahko naštvat, ale keď už nejaký ten mesiac hrania má niekto za sebou, pozerá sa na to aj z iného uhla.\n\n-: \n-Kopec cheaterov, ktorý by bez cheatov nezvládli nič hrať (asi najväčší problém). Toto by sa malo už viacej riešiť\n-deti pod 12 rokov, ktoré kazia celú hru, väčšinou však neúmyselne. Na to je treba si zvyknúť\n-hráči s nízkym IQ, ktorí kazia hru úmyselne. Takých však nieje až tak moc, no stále je to niečo\n-dosť sprosté hitboxy. 6 krát vystrelím na niekoho, zakaždým vidím, ako je naokolo neho krv po každej strele, a mne to napíše že som ho trafil 1 krát. FU*K LOGIC\n-spray pattern na jednotlivé zbrane nefunguje úplne na 100%. Vždy to má nejakú výchylku, no dá sa to naučiť tréningom\n\n+:\n+kvalita odpovedá cene do posledného centa\n+celkom pekná grafika\n+okrem iného, celkom friendly community (ako kto)\n+od  gold 2 už býva hackerov podstatne menej, najviac ich býva na silver rankoch\n\n\nTak celkové zhrnutie by som dal asi také, že hrať sa to dá, určite to nepatrí k najhorším hrám. Cheateri dokážu dosť naštvať, ale mňa ešte viac štvú spoluhráči, čo úmyselne kazia hru.  Každý si môže vytvoriť vlastný názor. Každý si príde na svoje, keď to vyskúša.",
  "Baví mě to hlavně je lepší to že tam nejsou žádný cheatery takže tak",
  "hodne jako nejete, az jako prejete bych konstatoval",
  "Why did I spend another 13 euros for the operation?\n\nedit It was worth it.",
  "Dobra hra \nJen trochu by to chtelo zlepsit ranking system protoze jsem mel 20vyher po sobe a pak jednu prohru a dostal jsem derank",
  "Sama o sobě je to návyková hra, pokud máte partu, se kterou můžete hrát. \n+ Kompetitivní mód s kamarády\n- Množství Cheaterů",
  "Ukradli ste mi medaili za rok 2021 šmejdi chci moji medaili",
  "čau tichacci potřebuju radu dělají si ze me srandu ze jsem moc lehky potřebuju byt taky takovej vyžranej pašík můžeš my prosím říct co kurva žereš že jseš tak vyžranej?",
  "Za mňa najlepšia hra všetci hovoria o anticheate ale ja som nestretol ani jedného heckera a to to hrám od 2016 aj s mojím starým účtom. Veľmi dobrá hra Odporúčam.",
  "hodně dobrá hra, akorát ty hit boxy a toxik Maďaři s Rusama jinak doporučuju je třeba si ale koupit prime kterej podražil\n",
  "Tahle hra mě baví asi nejvíce, jelikož mám rád kompetivní hry, counter strike mě baví již od 1.6 cs takže za mě tuto hru doporučuji.",
  "Kdyby byl lepší anticheat tak 100%. Nová operace se dle mě hodně vydařila, snad následující týdny umocní trošku příběhovou linku z prvního týdne :)",
  "skurvený cheateři , jeto droga jednou zapneš deně zapneš",
  "Výborná střílečka, kdyby bylo míň cheatru, bylo by to ještě lepší :) Hra se stále zdokonaluje, ale mohli by se zaměřit na potřebné věci, než na blbinky okolo.",
  "Kurva tohle je nejbrutálnější hra dopíči a vzpoměl jsem si že mám ve sklepě 1252 dětí a to je brutální tahle hra mě naučila násilí dokonce mi pomohla sehnat zbraň na černým trhu a teď si spokojeně střílím jedno děcko za den používám je jako train aimu chápete zajdu si do sklepa střelím z 25 metrů a takhle se zlepšuju v csku je to zaručený 100% funguje je to fakt dobrý jen je po tom zapíčenej bordel mělo by se to samo uklidit ale už mám automatizovaný systém takže mi jedno děcko utírá tu vymrdanou podlahu kurva teď jdu střelit další :)",
  "Vlastním tuto hru již od doby kdy nebyla zdarma. A od doby co je zdarma tak tam najdete mnohem více cheaterů. Pokud se ale nekoukáme pouze na tuto toxic herní komunitu, pak je tato hra velmi dobrá. Zaujme vás jak hratelností tak i dobrou grafikou. Rozhodně je to plnohodnotný nástupce svého předchůdce cs 1.6.\nDoporučuji\n\nPřeji vám příjemnou zábavu a doufám že vám má recenze pomohla.\n\n-VojbenCZ",
  "Je to dobrá hra, pokud vás nenaštve když vám někdo zrovna kazí hru, nebo je tam nějaký cheater. Tak je to vážně dobrá hra, nejlépe uděláte když si hru zahrajete se svýma kamarádama aby u toho byla trošku i sranda. Užívejte si pohody",
  "\nDit is 'n super speletjie om saam met 'n vriend te speel",
  "Bad for new players. Only hackers and smurfs on nonprime or low trust factor",
  "ak sa chcete odreagovat a vynervacit :D berte to :D",
  "TATO HLA NENY DOPLA I JE PLOTOSE SE NEMUSU TREFYT S DIGLEM DO HLA\\VI A ZABYJE ME S ČESETKOU KURVA",
  "Tuto hru snad ani nemusím představovat. Po 8smi letech od vydání se vývojáři každou chvílí opravdu snaží, vydávají jen další itemy za peníze(vzhledy na zbraně takže vám to bude úplně k ničemu). Na hře jako takové už pěkně dlouho nikdo nehnul ani brvou. Je hezké ,že vydali i free verzi ovšem tam kromě vás bude 100% hackerů všude okolo. No a když koupíte hru za peníze? To těch hackerů bude i více jak 100%. Co pro to dělají vývojáři? Nic jen si dál mastí kapsy, protože hráči této hry jsou tak ochotní ,že je furt zásobujou... Za 10 let už možná nebudou ani banovat to 1% hackerů co banovali do ted´. Čtenářům této recenze bych jako alternativu doporučil Insurgency a stránku této hry urychleně opustit. \nEdit: Po 3měsíční přestávce na hře trochu zapracovali a hra je na hratelné úrovni co se týče hackerů, přidaly nabídku nákupu ovšem jinak se toho moc nezměnilo. Hlavní důvod kvůli kterému jsem hru nedoporučil byli hackeři kterého jsem zatím nepotkal. Svoje doporučení měním na doporučuji jen s Prime Account.",
  "Zajímavá hra z pohledu ''first person shooter''. Hodně map, hodně zbraní, skinů, postav, dobrá komunita ( až na malé děcka co řvou do mikrofonu aka Rusáci ), dost módů ve hře, atd...\nJako plus ve hře beru to, že je zde například hodně ranků a pokud jste ''rank hunter'' a hru hrajete jen kvůli získání ranku v kompetitivních zápasech, tak i tak se dá docela zabavit, protože cestu do lepších ranků vám ztíží špatní teammati nebo například vyskillení protihráči. Jako mínus beru ve hře otevírání beden. Všichni víme, že v bedně je hooodně malá šance na nůž nebo aspoň červený skin, pomalu i růžový skin, ale i tak do toho házíme peníze a Valve se nám jen směje do obličeje, jak proděláváme víc a víc euro. I přes špatné teammaty, uřvané Rusáky a prohry jedna za druhou ( u někoho ), je pro mě stále super a oceňuji vývojáře, že do hry stále přidávají něco nového.",
  "Super Hra!\n+ kvalita, shadery\n+ skiny/music kity\n+ overwatch\n- zlý anticheat\n- toxic komunita\nInak fajn hra, doporucujem ;)",
  "cheaters and my girlfriend broke up with me cause of this game 10/10 would play again.",
  "Pro mě hra ke které se i přes vše vrátím znovu a znovu.",
  "Hra je skvělá, pokud nenarazíte na braindead polské / ruské děti, hra je naprosto v pořádku, jenom menší chybky ve VACu. Na mém mainu jsem dostal VAC, za nic. Hru doporučuji, ale musíte mít opravdu nervy ze železa, abyste se propracovali výše.",
  "řeknu ti to takhle, je to sračka ale zároveň prdel ",
  "SKURVENA VYJEBANA KOKOTINA\nRANK SYSTEM 0 BODOV \n7 Vyhier a nič, 2 prehry derank \nA CHEATERI ? Koľko len chcete\nČiže keď si radi ubližujete, máte radi sebapoškoďovanie smelo do tejto hry, na plno odporúčam.\nTúto hru hrá velmi vela vysoko inteligentných hráčov, ktorý vôbec nerozprávajú (však načo sú najlepší) alebo krčiacich Rusov.Táto hra z vás pomaly ale určite urobí rasistu, začnete nenávideť postupne všetky europske krajiny, najskôr Rusko, potom Turecko, Polsko aťd.",
  "srdcovka <3 akurat by na MM mohli konečne za tie roky urobit poriadny anticheat pretože MM sa už dnes neoplatí hrať. Valím iba FACEIT",
  "Je to velice kvalitní hra, ve které se dá naučit aim nebo svoje reflexi a doporučuje všem co mají rádi ať už kompetetivní stránku nebo jen hraní s přátely :)",
  "Vůbec mi to nejde :D občas jsem lucky AF ale jinak : aim na hovno, movement na hovno, crosshair placement na hovno, komunikace na hovno, motivace na hovno, sprej na hovno, cheateři na hovno, trihardi na hovno,\nAle i tak to prostě hraju :D \n+ skyny :)",
  "Najetá hra. Mega mě to baví a doufám, že zlepší anticheat!!! A nový operace pls xd",
  "dobrá hra lidi co ji nemají rádi JENOM NEMÁJÍ PENÍZE NA PRIMA loool",
  "Hra je v pořádku z pár směrů ale chtělo by to lepčí anticheat <3\n",
  "zachitovana pičovina plna kokotu, a typku co nemaji pipik,good job valve",
  "Jedna z najlepších FPS multiplayer hier všetkých čias. Ako každá hra, aj táto obsahuje veľa chýb a hráči budú vždy s niečím nespokojní. Keďže je už zdarma, mohli by sme uznať postupné vylepšovanie, aj keď väčšina z nás je opačného názoru a to, že upadá komunita či herné nadšenie vďaka premnoženiu cheaterov, rôznym herným crashom či výkonnostnými problémom. Každopádne sa my verní hráči či príležitostní milovníci kompetitívnych strieľačiek budeme obracať na legendu menom Counter-Strike. Aj napriek mínusom, ďakujem za veľa rokov plných virtuálnych zážitkov všeho druhu.",
  "Super online hra,když hrajeme s kamarády.Někdy zkažená hra,když narazíme na cheatery..",
  "V každý hře máte zdarma lekci ruštiny, za mě skvělá naučná hra 10/10",
  "Velmi doporučuji tuhle hru jen v připadě že nehrajete s hračem Lukito je to uplnej toxickej postiženej dement. v teto hře se mi libi hlavně to jake dostavam hlavy vždy si nad tím mastím kokutek a taky to že když někdo ma medaile za 10 let tak i tak hrač Lukito mu nadava že cheatuje",
  "Keď sa chcete doživotne zblázniť bez možnosti návratu do normálneho života tak odporúčam.",
  "je to mega super hra fakt doporucuju, CS:GO bylo zdarma ale prime jsem si koupil",
  "Dobrá hra, ale VAC systém je úplne na hovno. S tým f2p updatom ste zničili celú hru.",
  "Dobrá hra? byla do té doby dokud ji nedali f2p\njinak stále hraju a baví mě\n",
  "pohodová hra pro v pohodě lidi za mě nejlepší hra široko daleko,dobrý mapy dobrá komunita atd. xD",
  "weri gutt aj lajk it bykoz rusky detska co to hrajou su best",
  "Very good game, but without prime it will not give u good times",
  "Hra, kterou nesnášíte a milujete zároveň. I přes špatné i skvělé aktualizace se budete chtít ke hře vrátit (i když někdy po velmi dlouhé pauze).",
  "čo dodať hmm?? no nevedia spraviť jednu posratú hru bez toho aby tam nebol dáky ko... z WH",
  "tady jed o nervy a pro play jestli do toho nechcete dát 6000hodin tak se na to vyser",
  "very nice game. I highly recommend to play it with your friends.",
  "mega dobrá hra i se na ní pracuje všichni by jste to měli stáhnout",
  "velmi dobrá hra doporučuji kvuli tomu že můžete dostávat nabo kupovat skiny,hrát s hráčema je super  protože tam můžou být nejlepší kamarádi",
  "Velice zábavná hra, doporučuji hrát s přáteli poté je větší zábava.",
  "Hra nemá konce ale je tam moc hackeru a navíc když ste moc dobři dostanete ban protože je to Valve a CS:GO\n\n\nPlusy + Rank system \n             Hratelnost\n             Workshop\n             Skiny\n \nMinusy - Toxičti často hračí na Ranku Silver-Gold\n                Spousta Hackeru\n                Špatny AntiCheat ktery nefunguje spravně\n\n",
  "This game is so good. But i just got VAC for no reason :(",
  "Tato hra je opravdu skvělá,bývá při ní sranda když ji hrajeme s kamrády grafika na tu dobu bombová,hratelnost a ovládaní to nemá chybu",
  "dobra hra ale hlavne na nervy treba mat ich velmi pevne",
  "jo jeto super  hra jupííí větší píčovinu jsem nehrál",
  "csgo is realy boring fuul of hacker and russians idiots, dont play this game",
  "hratelny to je pokud mate plny tym kamaradu to je 5 lidi. z rusakama to fakt hrat nejde cheateri se nebanujou ale vy ban po nekolika random zabiti dostanete a nikdo to svama resit nebude",
  "Výborná a kvalitní hra, která nepřestala lidi bavit ani po těch dlouhých 7 letech. Jednoduše super.",
  "Velmi kvalitní hra ale serou mě toxický rusáci co to ani neumí hrát.",
  "Tato hra sežrala více mého času než jsem chtěl doporučuji .",
  "Things I gave to Counter-Strike:\n1. Money\n2. Time\n3. Love\n\nThings Counter-Strike gave me:\n1. Arthritis\n2. Rage\n3. smile\n4. Broken keyboard\n5. Broken mouse\n6. 9/10 ready\n7. Server crashes\n8. low IQ teammates\n9. Competitive matches\n10. \"Ez Pz\" spam\n11. Multilingual cursing - I guess this is a good thing?\n12. Lag\n13. Cheaters\n14. 64 tick servers\n15. Anxiety\n\n\nEssentially CS is a greedy woman, but I love her all the time.\n\n11 / 10 would play again",
  "Během hledání zápasu stíháte 2-3 dozory, takže myslím, že naprostá pohodka (:",
  "Hra je velmi dobrá jen mám jednu věc mohli by dávat víc update. A jinak hra je velmi grafický výborná no prostě 86%",
  "Docela ujde ale mohl by ten anticheat trochu vylepšit protože to stále banuje neviny a nebanuje spinbotery",
  "Čo Vám táto hra dá?\nPlusy a mínusy :\n+ Rage quit pri každom ruskom kokotovi v teame\n+ Písanie a hovorenie \"ez pz\" na konci každého kola\n+ Samozrejme ruský a poľský jazyk\n+ Rozlámanú klávesnicu\n+ Rozlámanú myšku\n+ Vyjebanie 100€+ na skiny, ktoré potom prehráte.\n\n- : Nič ^^\n\nUž ma nič viac nenapadne čiže 11/10",
  "Bolí ma hlava už to nezvládam, goučko večer zapínam, viem, že opäť chybujem nič si ale nedarujem, cskom tak trpím stále pri tejto hre má človek stále namále. Každý z nás len čaká, kedy mu príde výplata, aby mohol ďalšie casy otvoriť a veľké h*vno z toho zarobiť.\n\n10/10 game",
  "Pořádná hra pro pořádné kapry :D (a teď ten nožík Valve XD)",
  "Super hra,doporučuji všem!\n\n\nAle zvykejte si že CS GO má nejhorší anticheatovou ochranu na světě! \n50%+ players have cheat and steam sleeep !Verry bad work in guard from cheaters!",
  "I really like this game, but sometimes there are some russian people",
  "tato hra je velice dobrá a velmi rád ji hraju doporučuji vešm",
  "jeto mega hra otporučil bi som to hrat každemu je to zabavne  su tam pekne skini",
  "My friends suck my dick in this game so its a good game i love it",
  "csgo je dobra hra len škoda tých cheterov kokotných",
  "Dobrý věčer.Mám na vás prosbu aby jste mi odebrali vac ban,protože žádný hacky nemám.Klidně vám mohu ukázat celý můj počítač aby jste my odebrali vac ban.Můj Discord:Fibasak2006#3458.Děkuji za pochopení.",
  "Tato hra je anální rakovina mozku, závislost přichází po několika hodinách hraní, peníze se vám nevrátí a ste špatní. Hackeři budou jen v enemy týmu takže, budete derankovat pořád dokola. Přeji příjemné prožití vánočních svátku a čau vyvolávači :-)",
  "Po těch letech i tak zábavná ale občas dost na nervy hra :D\n\n+ Nesmrtelná legenda.\n+ Vždy se k ní rád po pauze vrátím.\n+ Líbí se mi že se dá vyhrát s nastavením a configem v souborech.\n+ Dobré nové aktulizace (operace, Broken Fang Premier, Pingy)\n+ V Broken Fang Premier je dobrý systém banování map.\n+ Občas se najdou velmi zábavný a dobrý hráči!\n\n\n- MM, Wingman Pouze 64tick servery i po tolika letech.\n- V Broken Fang Premier by mohl být na začátku knife round pro vybrání strany nebo jiný systém.\n- I s Prime je zde dost cheaterů i na dobrém trustfactoru (+Ale je to lepší než dříve :D)\n- Hráči bez mikrofonu i na Master Guardian+ ranku\n- Hráči kteří kazí hru jiným hráčům např. Griefing nebo poláci co neumí ani slovo anglicky.. Mohli by dostat svoje servery :D\n- Hitboxy jsou hrůza je to lepší než dříve ale stále na nic.\n\nVELKÉ ----- Rank Systém v Matchmakingu je to nejhorší co jsem kdy viděl!\n\n+ Ale i přes tyto věci zde máme FaceIT který mají 128tick servery, Pvpro kde se dá trošku vydělat ale za dlouho :D\n+ na FaceIT je méně hráčů kteří trollí.\n+ na FaceITu neexistujou hackeři nebo aspoň jsem ani jednoho nepotkal :D\n\nAle i přes několik těchto chyb CsGo zcela doporučuji!\n\nVaLuReMa: https://steamcommunity.com/groups/VaLuReMa\n\nUpraveno 26/12/2020",
  "No, dobrá, jelikož tahle hra je docela dobrá, tak bych Vám sem hodil pár důležitých věcí, které by měl každý vědět, než si tuto hru stáhne. Jelikož je free2play, tak ani moc NEMÁ smysl hrát compety nebo wingmany, jsou totiž úplně prolezlý cheatery, kteří si kompenzují malého pindíka cheaty, což je opravdu ubohé. Rozkaždopádně, hra není zlá, ale má spoustu chyb. Hlavně společnosti Valve jde spíš jen o prachy než o dobrou hru (wow, objevil jsem Ameriku). Prostě kdo nemá dřívější zkušenosti s touto hrou, ani to neinstalujte, jděte radši hrát Minecraft nebo Roblox nebo PayDay atd.\nSama o sobě je hra dobrá, ale je teď na non-prime mm fakt nehratelná. Na prime mm je to o dost lepší, protože většina cheaterů dostane ban ještě dřív než si stihne ten prime udělat, ale jsou tu i výjimky. Snad recenze trochu pomohla :)",
  "good game just lot of cheaters and valve do any good anticheat",
  "Je pravda, že od té doby co se stalo CS:GO free-to-play záležitostí, je ve hře opravdu zmatek, zapnout hru s členem který nemá zakoupený prime a nebo ještě nedosáhl 21 úrovně, aby si prime mohl aktivovat, je sebevražda. Tím že má možnost, každý hráč získat CS:GO doslova do pár minut, je naprosto normální, že se vám celou hru vede, ale někdo z protihráčů prostě neustojí to, že jste lepší než on a začne se TOČIT. (není tím myšleno, že napíše do konzole -/+left, ale normálně na hulváta stáhne nějaké free-to-use cheaty a cítí se hrozně drsně, když z prohrané hry 14-0 udělá zázrakem 16-14, jak úctyhodné). Ale abych zde jen nenadával na přesunutí CS:GO do free-to-play modu, jsou zde i plusy které sice nejsou v podobě nějaký darů od strany Valve, ale spíše opravování, různých bugů, či po případě přidání nějakých bedny, aby hráči mohly zase spokojeně utrácet své těžce vydělané peníze, za virtuální předměty a pixely ve hře. Ve hře CS:GO jsem i přesto věnoval několik stovek hodin a vůbec toho nelituji. \n\nHodnocení: 4/5 zlatých Bludišťáků.",
  "Its so much good game. I love it. Its Best game on Steam!!",
  "je to skvělá hra ale cheateri jsou na hovno REPAIR ANTICHEAT!!!",
  "amazing updates valve, ARE YOU DUMB? this is end of this game",
  "Tato hra je klasika mezi multiplayer střílečkami. Těžko se najde hráč, který by ji neznal. I přes pár chyb se řadí mezi nejhranější hry vůbec.\n\nRankovací systém je ale často zajímavý. Někdy se nad stylem, kterým dává ranky podivuji. Často se stane, že vyhrajete několik her za sebou a rank se vám nezvýší, ale jakmile jednu hru prohrajete, jdete o rank níž :D. Občas se také stává, že narazíte na nějakého toho hackera a tím pádem pro vás zápas ztrácí smysl, jelikož je s největší pravděpodobností předem prohraný. V takovou chvíli máte chuť hru opustit, ale doporučuji ji spíš dohrát, abyste nedostali ban.\n\nI přes těchto pár nedostatků se jedná o mou oblíbenou hru, kterou si rád zahraji, pokud mám náladu na nějakou tu střílečku. Ještě lepší je s kamarády, protože pokud si necháte spoluhráče přiřadit hrou, může se stát, že narazíte na toxic hráče, který v půlce zápasu začne griefovat.\n\n+ I přes stáří hry stále nové updaty a operace\n+ Lze hrát i zdarma\n+ Zabaví na dlouho\n\n- Hodně hackerů\n- Valve  už nechává vývoj spíše na komunitě, přidává hlavně skiny vytvořené hráči\n\n7 / 10",
  "velmi dobrá hra určitě doporučuji zlepšíš si aim a budes lepší i v Miinecraftu",
  "Ná této hře se mi líbí že zlepšili grafiku a celkově vše. Přibylo pár nových zbraní které v CS:S neznáte atd. Ranky jsou velmi dobrá věc alspoň máte vůli se zlepšovat a zlepšovat. U tohodle CSka se furt držím protože mě furt baví.\nAle jsou tu nevýhody a výhody:\n+naučíte se spoléhat na ostatní\n+seženete si přátele\n-špatná komunita kidi atd.\n-všichni hrají na rank\nAbych řekl tak skiny trochu hru pokazily.\nNež začnete nadávat na hitboxy atd. zkuste se zamyslet jestli chyba fakt nebyla na vaší straně (ano hitboxy nejsou perfektní ale vy taky ne).\nJe to hra která vás má zabavit a účel toho to plní.\nSem tam narazíte na pár toxic lidí,nejhůře ne Rusy a ne Poláky ale Čechy a Slováky.\nJenom ty updaty by mohly být častější a komunita by mohla být lepší.",
  "Asi nejvíc závisláková hra. Až na ten Anti-Cheats TOP <333",
  "je to picovina, jestli si to chces koupit uvaz moznost. Ze ti to znici zivot, psychiku internet a odjebes si dopici pulku pocitace a stolu, kazdopadne jestli mas rad sebeposkozovani tak tuto hru vrele doporucuju 10/10 ign dik mej se a cus bus autobus",
  "Hru jsem začal hrát v roce 2015!\nByla to jeba!\n\nZkouším znova!",
  "its good game but if they give me VAC for no reason or some reason: like now hacker got my steam account like yesterday...",
  "Super hra, ale nedoporučuji hrát bez placeného členství jinak li NONPRIME. Je to tam plné Heckerů👌",
  "je to super hra jen tam jsou cheateři ale když si zakoupíte prime tak by to mělo bý v pohodě doporučuju na 95%",
  "Je to strašná píčovina, ale přesto to doporučuju, která hra Vám umožní se změnit tak rapidně z klidného člověka na absolutně labilního člověka, který se nervově zhroutí?",
  "Dobrá střílečka s kámošema, ale taky hra plná noobů :D Ranked či hodnocené zápasy a možnost e-sportu je fajn :) Mapy prošly slušným remakem z dob cs 1.6 ještě :D",
  "Zdravím komunito!\nTato hra mě baví už od ranného věku.\nPro mě je skvělá i když mě štvou volně přístupné Cheaty které se ve hře vyskytují.\n\nRanking systém by se měl zlepšit aby hráči opravdu věděli jak na tom jsou a nebili jak na Ruské ruletě.\nKaždopádně za mě palec nahoru protože jsem milovník Cs 1.6 i Cs Go.\n\nRada na konec? \nTrpělivost přináší růže!\nTady jí opravdu budete potřebovat :D\n\nGh a hodně štěstí k vašemu budoucímu hraní!",
  "Tuto hru miluji a milovat ji budu, i když jsem jí pár měsíců nezapnul furt si říkám kdy si ji zahraju, je to přesně 4. měsíce co jsem hru neměl ve svém počítači, a scházela mi ? STRAŠNĚ MOC ! A proto hru doporučuji, ale né si ji stáhnout, ale koupit. ( Jinak tam bude hackerů že je ani nespočítáte ) :D",
  "Plusy a mínusy:\n+ Pokud umíte nadávat Rusky skvěle zapadnete do vašeho teamu \n+ Nezapomeňte projebat celou vaší příští výplatu na Loot boxech za 2€ \n+ Vše je vždy chyba teamu takže i kdyby jste celou hru nikoho nezabili, stěžujete si na ně jak dělaj hovno (Rusky samozřejmě, jinak vám nebudou rozumět)\n- Enemy team má vždy sex s vaší matkou\n- Anticheat by horší snad bejt ani nemohl \n- Pokud máte víc killu jak celý enemy team, automaticky máte cheaty",
  "hra je super. Tudle hru jsem si zamiloval, líbí se mi že se mám co učit např mapy reacoil zbraně nakupování bunnyhop atd.\nano unnticheat není dobrý ale je dobře udělaný. je dobře že zapojili komunytu k tomu aby banovali hackeri. ranked sistém je dost na nic já mám 580 hod a vyrovnám se i goldu 3 ale já jsem furt silver. ale tuto hru doporučuji není moc náročná, a nonprime mechanika je velice dobrá a modů tam není hodně ale vystačíte si ale pokuť stecholerik tak nehrajte armrace.\n",
  "sračka, nehrejte to, prosím\nzkazí vás to\nváš život bude v píči",
  "Counter-Strike: Global Offensive is very good game but that anti cheat is not very good but game is good :)\n",
  "ta hra a ten prime za uroven 22 a nemusim si to kupovat super",
  "10*/10*\nAž na všudypřítomné cheatry v non-prime matchmakingách je hra dobrá. \nHra odreaguje na velmi dlouhou dobu.\nHvězdičky za cheatry a toxic protihráče i spoluhráče neubírám:)\n",
  "líbí se mi že v té hře je banda polskejch a ruskejch čuráku na kompetu je to totiž zabava poslouchat ty šamanský kouzla",
  "Klasická hra, která nemůže nebavit klasického hráče.. :)\n\nPodle mého názoru se jedná o zatím nejlepší verzi hry Counter Strike. \nHrál jsem 1.6, CS:CZ, Source a teď i CS:GO\n\nNejsem profi hráčem CS, ale jako hráče všech možných her, mě tato hra baví stále a pořád se máte co učit, což mě na tom baví. \n\nTuto hru doporučuji, mít v základním / startovním balíku her, které vlastníte.. :)",
  "PEKNE SHIT MATCHMAKING ALE JINAK KOMUNITAKY JSOU PECKA",
  "Chtělo by to normální spoluhráče a lepší anticheat. Má to lepší gameplay než X Adventure v GD.",
  "MEGA me to bavi ale mohly by dat vetsi sanci na knife",
  "opravdu skvělá hra, momentálně pohltila všechen můj volný čaš :/ <3",
  "Klasická fps hra která dokáže hráče udržet na několik hodin.",
  "Doporučuji všem fanoškům dílů Counter Strike, protože tenhle díl je podle mě nejlepší ze všech a má před sebou velkou budoucnost !",
  "\nI love this game, but sometimes I got angry about hackers :) 11/10",
  "I přes cheatery ve hře bych hru doporučil, zabaví na víc jak 6000 hodin a stále mám chuť hru hrát ( jak kdy :D ). Co ale nedoporučuju, je otvírání beden:-D",
  "Police vs terrorist what else should i say about it",
  "je fakt dobra hra ale kupte si radsi prime jinak samy hacker :))))))",
  "i hate it. i have ban for nothing thank you :)\nbest game ever",
  "Velice dobrá hra\n\nKamarád: Kur*a hacker zasra*ej\nJá: Všichni co jsou lepší než ty nemusí být hackeři.\nKamarád: User disconnected from your channel\n",
  "super, aj po tom ako dlho to tu už je...proste nesmrteľná hra :D",
  "If you have 4 friends - you win \nIf you dont - you lose",
  "Nejlepší hra na světě, bavilo by to i tvojí mamku, určitě doporučuju aspoň vyzkoušet!",
  "Good game i love it, but on my other account i was banned for nothing, but its really good game i promise.",
  "This game will be good without cheaters but i like it.",
  "CSGO je moje srdcovka. Ačkoliv mě sem tam štvou cheaty, tak VALVe dělá zázraky a fakt to omezili! Nedávno jsem si koupil prime a je to 100% lepší!",
  "very interesting personatily, very enjoyable spent of time",
  "Velice kvalitní střílečka, která dokáže zabavit na dlouhou dobu. Hru hraju pár let a nikdy mě nezklamala. Srdcovka. Doporučuji.",
  "Really good game, but lot of cheaters and russians i highly recommend it!",
  "Kde bych začal.Nejdříve s plusy\n\n-i po těch letech má jednu z nejaktivnějších komunit \n-nemá extrémě dobrou grafiku ale také nevypadá jako hra z gameboye tudíž jí rozjede i člověk se slabším počítačem \n-je niní free-to-play ale dle mého názoru to tu hru nezničilo a právě naopak si myslím že se komunita cska ještě zvětšila\n-UPDATY jsou cca každé 2 měsíce a zde je vidět snaha Valve udržet CS:GO při životě \n\nNo ale každá hra má i své zápory\n-ZBRANĚ jsou někdy tak nepřesné až to bolí vidět \n-HITBOXY jsou špatně umístěné (takže máte šanci že místo zabití hráče jen kulka proletí)\n-BEDNY nejde o to že by mikrotransakce byly nějak špatné pokud se jedná jen o kosmetickou věc ale jde spíše o to že bedny nejsou vůbec vyvážené a skoro nikdy se vám nestane že by jste droply červenou nebo zlatou kvalitu \n-TEAM skoro nikdy se vám nestane že dostanete nějaký epic win team spíše dostanete Rusy a polovina teamu sice komunikuje ale rusky a minimálně jeden z nich cheatuje a další radši vůbec nemluví \n\nUrčitě by se našlo více kladných věcí a také záporných ale to je vše na co jsem si vzpoměl. LUL\n\n7/10",
  "Velmi doporučuji . Hra je velmi kompatibilní i s horšími pc . Stačí se jen naučit.",
  "Veľmi návyková hra. Niekedy keď hrám tak má nepriateľ oveľa viac nahratých hodín ako ja.",
  "---{Graphics}---\n☐ You forget what reality is\n☐ Beautiful\n☑ Good\n☐ Decent\n☐ Bad\n☐ Paint.exe\n\n---{DLC/In Game Purchases}---\n☐ More paid content than the actual game\n☐ A lot\n☐ Few\n☐ Almost none\n☑ None\n\n---{Level/Map Design}---\n☐ Better than the real world\n☑ Very good\n☐ Decent\n☐ Poor\n☐ No\n\n---{Community}---\n☑ Very active\n☐ Big enough\n☐ Not big, not small\n☐ Small\n☐ Nobody plays this\n\n---{Update Regularity}---\n☑ Commonly updated\n☐ Often\n☐ Once a while\n☐ Rarely \n☐ No more updates\n\n---{Cheaters}---\n☐ SG game\n☐ No cheaters\n☐ Very rarely\n☑ Once a while\n☐ Pretty often\n☐ Only chaters are online\n\n---{File Size}---\n☐ More than 100GB\n☐ More than 50 GB\n☐ More than 10GB\n☑ More than 1GB\n☐ Less than 1GB\n\n---{Controls}---\n☐ Joy to play\n☑ Very good\n☐ Decent\n☐ Bad\n☐ Awful\n\n---{Singleplayer/Multiplayer}---\n☐ Only SG\n☐ Joinable servers\n☑ Only MP\n\n---{Replayble}---\n☑ Yes\n☐ More yes than no\n☐ More no than yes\n☐ No\n\n---{Gameplay}---\n\n☐ Very good\n☑ Good\n☐ It‘s just gameplay\n☐ Starring at walls is better\n☐ Just don‘t\n\n---{Audio}---\n☐ Very good\n☑ Good\n☐ Not too bad\n☐ Bad\n☐ Earrape\n\n---{Audience}---\n☑ Kids\n☑ Teens\n☐ Adults\n☐ Lizards\n\n---{PC Requirements}---\n☑ Potato\n☑ Decent\n☐ Fast\n☐ Rich boiiiiii\n☐ Ask NASA if they have a spare computer\n\n---{Difficulity}---\n☐ Just press ‚A‘\n☐ Significant brain usage\n☑ Easy to learn / Hard to master\n☐ Difficult\n☐ Dark Souls\n\n---{Grind}---\n☑ Nothing to grind\n☐ Only if u care about leaderboards/ranks\n☐ Isnt necessary to progress\n☐ Too much grind\n☐ You‘ll need a second live for grinding\n\n---{Story}---\n☑ Text or Audio floating around\n☐ Average\n☐ Good\n☐ Lovely\n☐ It‘ll replace your life\n\n---{Game Time}---\n☐ Long enough for a cup of coffee\n☐ Short\n☐ Long\n☑ To infinity and beyond\n\n---{Price}---\n☑ It’s free!\n☐ Worth the price\n☐ If u have some spare money left\n☐ During a sale\n☐ Not recommended\n\n---{Bugs}---\n☑ Never heard of\n☐ Minor bugs\n☐ Can get annoying\n☐ The game itself is a big terrarium for bugs\n\n---{Overall Opinion}---\n☐ 1/10\n☐ 2/10\n☐ 3/10\n☐ 4/10\n☐ 5/10\n☐ 6/10\n☐ 7/10\n☑ 8/10\n☐ 9/10 \n☐ 10/10",
  "tato hra je už srdcovkou hodně lidí a stále nás nedokáže nudit",
  "super ale snad uz nedostanu vac ban za nic,defakto prej za sdileni tel cisla \n",
  "Je to dost v pohodě LMAO xdd ... prostě hraju all day ale škola jde dopice no :(( ale tak je to zdarma že,,,",
  "Na cs go mam nahranych 1800h a je to dobra hra s kamarady",
  "Super týmova akčnÁ strielačka len škoda že tolko ľudí čituje trebalo by posilnit ochranu proti hackom :)",
  "Hra je samozřejmě dobrá, hraji ji už nějakou dobu a pokud by taková hra neexistovala tak nepoznám dobré lidi",
  "Velice dobrá hra. Vždycky mi zlepší den pár 12 letých ruských dětí, které mi řeknou, že měli pohlavní styk s mojí mámou. :)",
  "hra je dobrá chtělo zapracovat na anticheatu a pozor na raige",
  "............................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................................",
  "Very good game, 0% depression yes i never had depression of this game please kill me.",
  "Tuhle hru miluju,ale od posledního update narážím na každém rohu na cheatera.Vac Ban vlastně ztratil význam,protože si každý cheater hru stáhne znova a jede se dál!Proboha kdo tohle vymyslel?????Měli naopak cenu zvednout,třeba na 20 éček.Hrozně mě to štve,lidi co hrají fér,mají odehraných stovky hodin a už něco umí,pak narazí na týpka co má nějakých 10hodin a ten dává hlavy jak šéf.Proč by se něco učil,když si stačí stáhnout nějaký program,co hraje za ně.Ale koho to baví?????No.......přesto to budu hrát dál,oni totiž ti cheateri jsou kolikrát špatní i tak,takže porazit takového debila je celkem dobrý pocit.Přesto všechno tuhle hru doporučuju,třeba se stane zázrak.......",
  "dobrá hra :D, Prime - Hry bez cheaterů jen za 10e :)",
  "how this shit game can work? BROKEN HITBOXES -.- and a lot of cheaters",
  "Moje srdcovka, od mala jsem ji chtěl hrát a ted už ji hraju 4 roky a furt nej hra prostě bomba",
  "tahleta hra mi zkurvila smysl zivota. ngl to nestahujte je to totalni cancer hovno",
  "This game is very naštvat mě and já zničit moje klávesnice 11/10 very nice gejm :D",
  "nejlepší hra,nekdy te fakt naštve ale furt je to dobra hra",
  "Kvalitní střílečka, která otestuje váš skill a spolupráci.",
  "jediné co mi na téhle hře vadí že si nikdo nedá tu práci aby se omezilo střetávání proti hackerům jinak super na odreagování",
  "Sam rusák,samí hackeři,nejlepši anti-cheat a tak dále...",
  "Určitě to není špatná hra, ale je potřeba mít někdy pevné nervy na cheatery.. :)\n\n-Foxálek",
  "Túto hru ako všetci dobre poznáme je veľmi jednoduchá no stále trend. Nikdy neprestane baviť!",
  "If you wanna enjoy this game in 2020 you gotta get prime",
  "Sračka plná toxickejch ruskejch dětí. Miluju to :DDDDD",
  "SO FUCKIN GOOD GAME, BUT VALVE ANTICHEAT IS BULSHIT, DOWNLOAD :)",
  "I can surely tell this game is good, but theres only one problem.. MAG-7 olayers and cheaters.) Honestly after last updates it gets better.. I highly recommend this game but don't forget to upgrade you status to PRIME!!",
  "Víc cheaterů než normálních hráčů, free to play špatným krokem... Ačkoliv jde tato hra stále dál do háje, stále mě baví a dávám do ní prachy. xd Takže +rep xd",
  "Pokud narazíte na slušnej oddíl, dá se tam zažít spousta zábavy. :D",
  "Hra je zajímavá, ale hitboxy nefungují. Ale jinak doporučuji.",
  "Nesnáším a zároveń miluji tuhle hru, but still trash xd <3\nStill pain in ass <3",
  "Zdravím, chci zrecenzovat tuto úžasnou hru. Takže, tato hra je extrémě návyková a strašně skvělá, ať už možností skinů na zbraních apod. nebo tou skvělou grafikou kterou tam najdete, hru jsem si hned zamiloval. Doporučuju. <3",
  "Dobrá hra ale cheateři sou všude špatny vac a ty rank system tak nic moc\n",
  "Nice game, but danger zone is bad and boost on vertigo. Please repair this",
  "CO VÍC SI PŘÁT ?\nstahuj a hraj, moc dobře vím že už to nevypneš i když tě na každém rohu čeká fight s cheaterem\na nezapomeň vždy když zabiješ cheatera napiš do all četu EZ :)",
  "Hra je dobra keď nebereme ohľad na velké množstvo cheaterov ktorý hru kazia",
  "najlepsia hra pre viacej hracov da sa na nej aj slusne zarobyt\n",
  "Nejlepší hra, kterou jsem si prostě musel koupit. Rozhodně doporučuji :)",
  "Tyvole největši vyjebanost co jsem kdy hrál dali to zadarmo takže hackerů jak ochcaných plotů a navíc Ruský a Polský děcka co nadavají. Furt to hraji ale už mám 8x rakovinu, thank you za přečtení a hrajte to jen 53min. denně thank you pičo.",
  "Tato hra mi změnila život, je to zajímavá zkušenost do života :). Hodně mě baví :). Díky ní jsem mentálně zralý a připravený do života, uvědomil jsem si že na tom nejsem zas tak špatně :) ..... fakt super hra :) ..... pomoc ... :)",
  "no comment, best hra škoda těch cheaterů , doporučuji všem kdo ještě nehrály :)",
  "Zábavná FPS hra (strielačka) ktorá zabavý na desiatky hodín ktorá obsahuje team deadmatch kompletitivný alr aj batlle roayale zápas. obsahuje microtransakcie ale len kosmetické.",
  "Very good game with better update! I have no more cheaters in game and I am feeling free and more happy with it.",
  "---{Gameplay}---\n🔳Try not to get addicted\n☑️Very good\n🔳Good\n🔳Nothing special\n🔳Ehh\n🔳Bad\n🔳Just dont\n\n---{Graphics}---\n🔳Masterpiece\n🔳Beautiful\n☑️Good\n🔳Decent\n🔳Will do\n🔳Bad\n🔳Awful\n🔳Paint.exe\n\n---{Audio}---\n☑️Fascinating\n🔳Very good\n🔳Good\n🔳Decent\n🔳Not too bad\n🔳Bad\n🔳Earrape\n\n---{Audience}---\n🔳Kids\n🔳Teens\n☑️Adults\n🔳Everyone\n\n---{PC Requirements}---\n🔳Check if you can run paint\n🔳Potato\n☑️Decent\n🔳Fast\n🔳Rich boi\n🔳Ask NASA if they have a spare computer\n\n---{Story}---\n☑️Doesn't have\n🔳Something isnt nothing I guess\n🔳Not greatly told\n🔳Average\n🔳Good\n🔳Lovely\n🔳Will make you cry or smile alot\n\n---{Playstyle}---\n☑️Almost never the same in any two people\n🔳Varies a little bit from person to person\n🔳Weapon AND character classes\n🔳Weapon OR character classes\n🔳Creative AND Survival\n🔳Creative OR Survival\n🔳Melee AND Ranged\n🔳Melee OR Ranged\n\n---{Difficulity}---\n🔳Just press a bunch of buttons\n🔳Easy\n🔳Significant brain usage\n🔳Easy to learn / Hard to master\n🔳Not so easy\n🔳Difficult\n☑️Dark Souls\n\n---{Grind}---\n🔳Nothing\n🔳Only if you care about leaderboards/ranks\n🔳Isnt necessary to progress\n🔳A bit grindy sometimes\n🔳Average grind level\n🔳A bit grindy\n☑️Insanity\n\n---{Game Time}---\n🔳Long enough for a cup of tea\n🔳Short\n🔳Average\n🔳Long\n🔳Depends on you\n☑️Endless\n\n---{Price}---\n🔳Just buy it\n🔳Worth the price\n🔳Wait for sale\n🔳Maybe if you have some spare money left\n🔳Not recommended\n🔳Dont throw money into a rubbish bin\n🔳♥♥♥♥♥♥♥♥♥♥♥♥♥Micro-Transactions}---\n🔳EA\n🔳Mobile Game(Necessary if you don’t want to wait 15 weeks to construct a toaster)\n🔳 ''Premium” Currency AND Normal Currency\n🔳”Premium” Currency OR Normal Currency\n🔳Quick way to advance\n🔳(Skins/Emotes/Etc)\n🔳Only to show off big time\n🔳Level DLC\n☑️None\n\n---{Bugs/Glitches}---\n🔳Never had any\n🔳Minor bugs/glitches\n☑️Few bugs/glitches\n🔳Can get annoying\n🔳Ruining the game\n🔳The game itself is a big terrarium for bugs/glitches\n\n---{?/10}---\n🔳1\n🔳2\n🔳3\n🔳4\n🔳5\n🔳6\n🔳7\n🔳8\n🔳9\n☑️10",
  "Je to jako lolko, ale je tam míň čarodějů a více rusáků",
  "This game have very good gameplay.\nLots of toxic players.",
  "Recenze na Counter-Strike: Global Offensive\nHru CS: GO jistě všichni znáte, ale pro z vás, kdo by náhodou nevěděli (tady nikdo takový není) je to FPS týmová kompetitivní střílečka. Kde proti sobě stojí dva týmy (CT) a (T). Nicméně v této recenzi nechci popisovat princip hry, ale porovnat non-prime a prime.\nNa non-primu jsem nahrál 50 hodin a můžu říct, že situace s hackery není tak tragická, jak ostatní popisují. Ovšem občas se stane, že ho potkáte. Jak už je zvykem spamujete tlačítko report a následně prosíte spoluhráče nebo protihráče, aby ho vyhodili, když se tak stane tak si užijete hru i na non-primu. A pro ty, co tvrdí, že report nefunguje tak mě byla několikrát zaslaná zpětná vazba „Děkujeme vám za úspěšné odhalení hackera.“\nNa primu se mi podařilo nahrát stejný počet hodin (50). A hned si všimnete několika zásadních rozdílu. Hlavním důvodem, proč si koupit prime je, že zde používá cheaty minimum lidí (já jsem zatím žádného nepotkal). Dále si všimnete že čekací doba na zápasy se vám výrazně zkrátí (než se dostanete na vysoký rank). Také zde najdete lepší hráče, takže se můžete zlepšovat. A obecně prime účet přináší další výhody.\nHra je velmi zábavná, když nepotkáte toxické hráče (Rusáci nemusí být vždy toxic). A pokud byste chtěli hrát CS: GO pravidelně doporučuji zakoupit více klávesnic (budou vám mizet v průběhu hraní) a také prime účet.\nDoufám, že tato recenze byla užitečná nebo vám jinak pomohla.",
  "Counter-Strike: Global Offensive opravdu ? Jsem jeden z hráčů, kteří si hru koupili než přešla do f2p modelu.\nCSGO je a pravděpodobně bude vždy v mém herním srdíčku, protože celkově na něm mám asi nahráno přes všechny účty přes 1000 hodin. Také staré CS 1.6 nebo Source jsou nezapomenutelné díly této série. \n\nCS:GO je klasická kompetitivní střílečka s teroristy a policisty. Jeden tým má za cíl bombu položit a ten druhý zase zneškodnit samozřejmě také se mohou oba týmy vystřílet a to ukončí kolo též.\n\nHra může nabídnout  WorkShop kde si jak můžete prohlížet skiny, které vytvořili jiní hráči, tak i zahrát příběhové mapy či jenom procvičovat svůj aim, aby jste se vyhrabali ze Silveru.\nMarketShop kde si můžete nakupovat jak skiny, které přímo chcete nebo bedničky a kliče kde máte určité procenta na určité odměny. Takže můžete koupit bednu a klíč celkem za 3 eura a vydělat 30 eur, protože vám padne dobrý skin nebo prodělat protože vám spadne modrá srač... skin za 3 centy, který prostě nechcete.\n\nGamePlay: Hra nabízí několik módů od komunitních map, které se liší až po mód kde můžete skákat se Scoutkou jak ve vesmíru a jen tak si střílet do nepřátel. Máme klasický kompetitivní mód, který je asi nejvíce hraný a známý. Hraje se vždy do prvních 16 vyhraných kol nebo do 15:15 kde to skončí remízou. V CS:GO nejde ale jen o váš Aim ale taky znalost mapy a znalost granátů. Takže pokud znáte samotnou mapu a víte kam hodit smoke máte okamžitou výhodu nad nepřítelem, který mapu nezná a ví maximálně to jak skočit do AWPčka na midu. \n   Hra je poslední dobou prolezlá Cheaterama bohužel více než tomu bylo kdysi a i tak to bylo hodně. F2P model přinesl hodně dobrých hráčů to ano, ale bohužel i cheaterů, kteří podvádí občas klidně i měsíce než dostanou ban. Jsou i cheateři, kteří normálně mohou hrát a kupovat si skiny a ve většině případech nedostanou ani ban. Takže pokud používáte SkinChanger za, který by údajně neměl být ban a dostanete za něj ban místo někoho kdo cheatoval tak to dokáže pěkně naštvat. \n\nRank Systém: Snad možná nejvíc matoucí věc na CS:GO je ranked systém. Nikdo pořádně neví jak funguje tedy pokud nějak funguje. Nikde ve hře nevidíte svoje průměrné MMR takže nevíte kdy DeRanknete nebo kdy RankUpnete klidně můžete vyhrát 6 her v řadě a nemusíte rankupnout ale můžete prohrát jednu a deranknout. Celkově nemáte přehled o tom jaký rank budete mít prostě ve většině času musíte doufat, že tohle je vydařená hra a že budete mít rankup.\n\nCelkové Shrnutí: CS:GO je klasická kompetitivní střílečka, kterou má cenu si zahrát, protože je ve f2p modelu v tuhle chvíli. Hra má co nabídnout, protože pokud vás nebaví kompetitivní mód, tak můžete surfovat v komunitních serverech nebo si hrát na vězně a dozorce.\n\nOsobně doporučuji si vyzkoušet Valorant pokud chcete hrát kompetitivně, protože RankedSystém, tak dle mého funguje lépe.",
  "Srdcová záležitost, hratelnost super.  Chce to hrát s kamarády a mít zakoupený Prime. Jinak to smysl nemá.  Velké mínus je velice toxic komunita. \n\nChtelo by to castejsi operace, battle pasy apod., pro oziveni hry.",
  "Pokud nemáte rádi v každé druhé hře hackera, doporučuji investovat 13 euro a koupit PRIME",
  "pokud chcete zjistit kolik polských dětí spí s vaši matkou tak je tato hra ideální.",
  "Ak nemáš kamaratov a tvoj život je na nič tak doporučujem tuto hru... po odohraných 500hodinach budeš mať samovražedne sklony. :)",
  "Very good game for competetive players skill based game which you have to tryhard\nComing back from some time and still playing. This game is just awesome",
  "This game is very nice in HITBOX but ranked system is little broken.",
  "Counter-Strike Global Offensive je velice dobrá FPS hra až poněkud nedodělaná z důvodu drobných chyb player modelu.Fyzika zbraní je celkem dobře provedená i když se najdou chyby.Fyzika samotná se zdá bez problému,ale zase najdou se chyby.Tato hra má týdenní updaty do je palec nahoru,ale Valve nemá dost aktivní podporu hráčů a to se mi nelíbí na této hře (vývojářích).\nKdo by si chtěl zahrát nějakou FPS (First Person Shooter) tak CS:GO je nejlepší volba na začátek.",
  "Dobrá hra až na obyvatele ruské destinace kteří ke svému velmi kvalitnímu gamepleji používají vulgární výrazy v ruském jazyce které konstantují do svého mikrofonu z lidlu. To mně trošičku štve. Ale co nespravý mute že ano :) \n\nA další věc jsou hackeři kteří nemají nic jiného na práci než se točit jak vrtule a dávat noscope hlavy.\n\nAle furt tuto hru hodnotím 10 rusáku z 10 (10/10)",
  "jakoby je to super hra ale mohli by jste zlepšit anti cheat aby nerozdával bany bezdůvodně\na jakoby chtěl bych alespoň své staré skiny co jste mi vzali thanks -__-",
  "Hra není ani tak moc o taktice, ale spíše o dobrém míření na protivníky, promyšleném házení granátů a chytrém spotřebovávání peněz pro výhodnější nákupy do dalších kol. \n----------------------------------------------------------------------------------------------------\nGameplay je sám o sobě brilantní, máte zde totiž k dispozici sedm možností pro typ zápasu.\n----------------------------------------------------------------------------------------------------\nToto je má nejoblíbenější hra na celém Steamu, avšak mi vadí, že z ní udělali Free to Play. Občas kvůli toho narazíte na nějaké hackery a hra je pak nezáživná.\n----------------------------------------------------------------------------------------------------\nPokud budete mít 150 vítězství a rank Gold Nova 1, tak můžete dělat i tzv. Overwatche. Stáhnete si video záznam kompetitivního zápasu, zkontrolujete podezřelého jestli nepoužíval externí soubory a většinou ho pak prohlásíte vinným.\nProblém spočívá v tom, že než vy překontrolujete celý zápas, tak si podezřelý stihne vytvořit úplně nový účet. (Tudíž, nikdy nikoho pořádně nezabanujete.)\n----------------------------------------------------------------------------------------------------\nHru převelice doporučuji. A pokud chcete, rád si ji s vámi zahraji.",
  "Good game, but the cheaters destroing the point of it ! <3",
  "If you do not catch cheaters, it is pretty good game.",
  "Nezapinat se slabym srdcem, hrozi infarkt, hlavne po obdaření headshotem"
]